{
  "WORD":"baptize",
  "IPA":"/ˈbæptaɪz/",
  "CONJUGATES":"baptizes | baptized | baptizing",
  "ETYMOLOGY":"From Old French baptiser, from Latin baptizare, from Ancient Greek βαπτίζειν (baptízein, 'to immerse, to wash, to baptize'), from βάπτω (báptō, 'to dip').",
  "SINCE":"Late 13th century",
  "MEANINGS":[
    {
      "PATTERN":"baptize [sb]",
      "POS":"vtr",
      "POS_TIP":"transitive verb: a verb that requires a direct object to complete its meaning",
      "TAGS":[
        "core word",
        "religious"
      ],
      "DEF_EN":"To perform the Christian sacrament of baptism on someone, typically involving immersion in or sprinkling with water, often accompanied by naming.",
      "DEF_ZH":"对某人施行洗礼（基督教仪式），通常涉及浸入水中或洒水，并常伴有命名。",
      "SENT_EN":"The priest will baptize the baby next Sunday at the church.",
      "SENT_ZH":"牧师将于下周日在教堂为这个婴儿施洗。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "christen"
          ]
        }
      ]
    },
    {
      "PATTERN":"baptize [sth]",
      "POS":"vtr",
      "POS_TIP":"transitive verb: a verb that requires a direct object to complete its meaning",
      "TAGS":[
        "common",
        "figurative"
      ],
      "DEF_EN":"To give a name to something, often in a formal or ceremonial way, as if in a baptism.",
      "DEF_ZH":"给某物命名，常带有正式或仪式感，如同进行洗礼。",
      "SENT_EN":"They decided to baptize their new yacht 'The Sea Serpent'.",
      "SENT_ZH":"他们决定将他们的新游艇命名为“海蛇号”。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "christen",
            "name"
          ]
        }
      ]
    },
    {
      "PATTERN":"baptize [sb] with [sth]",
      "POS":"vtr + prep",
      "POS_TIP":"transitive verb followed by a preposition: a verb that requires a direct object and is then followed by a preposition to introduce additional information",
      "TAGS":[
        "less common",
        "figurative"
      ],
      "DEF_EN":"To initiate someone into a new experience or condition, often a challenging or transformative one, as if purifying them.",
      "DEF_ZH":"使某人经历某种新的体验或状态，常指有挑战性或具变革性的，如同对其进行净化或洗礼。",
      "SENT_EN":"The harsh winter conditions baptized the new recruits into the realities of mountain warfare.",
      "SENT_ZH":"严酷的冬季条件使新兵们在山地战的现实中得到了洗礼。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "initiate",
            "inaugurate",
            "purify"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Formal or religious for the primary meaning; common for figurative uses."
}