{
  "WORD":"closure",
  "IPA":"/ˈkloʊʒər/",
  "CONJUGATES":"closures",
  "ETYMOLOGY":"From Old French closure, from Medieval Latin clausura ('a closing, a fastening, a barrier'), from Latin clausus, past participle of claudere ('to close'). The psychological sense of 'resolution of emotional distress' dates from the mid-20th century.",
  "SINCE":"Late 14th century (general sense); Mid-20th century (psychological sense)",
  "MEANINGS":[
    {
      "PATTERN":"closure of [sth]",
      "POS":"noun",
      "POS_TIP":"A noun is a word that refers to a person, place, thing, or idea. In this context, 'closure' refers to the act of closing or the state of being closed.",
      "TAGS":[
        "core word",
        "common",
        "formal",
        "business"
      ],
      "DEF_EN":"The act or process of closing something, or a situation in which a place of business or an organization stops operating.",
      "DEF_ZH":"关闭某事物的行为或过程，或指某个商业场所或组织停止运营的情况。",
      "SENT_EN":"The sudden closure of the factory left many people jobless.",
      "SENT_ZH":"工厂的突然关闭让许多人失业。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "cessation",
            "termination",
            "shutdown",
            "ending"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "opening",
            "inception",
            "commencement"
          ]
        }
      ]
    },
    {
      "PATTERN":"find closure | get closure",
      "POS":"uncountable noun",
      "POS_TIP":"An uncountable noun is a noun that does not have a plural form and refers to something that cannot be counted, such as a concept or a quality. Here, 'closure' refers to an emotional state.",
      "TAGS":[
        "common",
        "psychology",
        "idiomatic"
      ],
      "DEF_EN":"A feeling that an emotional or traumatic experience has been satisfactorily concluded; a sense of resolution or finality.",
      "DEF_ZH":"指对某种情感或创伤性经历感到满意地结束，获得一种解决或终结的感觉。",
      "SENT_EN":"After years of grief, she finally found closure regarding her brother's disappearance.",
      "SENT_ZH":"经过多年的悲痛，她最终就弟弟的失踪找到了慰藉。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "resolution",
            "finality",
            "settlement",
            "peace of mind"
          ]
        },
        {
          "T":"related",
          "V":[
            "acceptance",
            "healing",
            "reconciliation"
          ]
        }
      ]
    },
    {
      "PATTERN":"a closure [procedure]",
      "POS":"noun",
      "POS_TIP":"A noun is a word that refers to a person, place, thing, or idea. In this context, 'closure' refers to a parliamentary or procedural mechanism.",
      "TAGS":[
        "formal",
        "politics",
        "legal"
      ],
      "DEF_EN":"A procedure in a parliamentary or legislative body to end a debate and take a vote.",
      "DEF_ZH":"在议会或立法机构中，结束辩论并进行投票的程序。",
      "SENT_EN":"The government moved for closure to bring the long debate to an end.",
      "SENT_ZH":"政府提出结束辩论动议，以结束漫长的辩论。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "cloture",
            "gag rule"
          ]
        },
        {
          "T":"related",
          "V":[
            "motion",
            "vote"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Widely used in general conversation, business, and psychology. The third meaning is more formal and specific to parliamentary/legal contexts."
}