{
  "WORD":"cynical",
  "IPA":"/sɪnɪkəl/",
  "CONJUGATES":"cynically (adv) | cynicism (n)",
  "ETYMOLOGY":"From Latin cynicus, from Greek kynikos ('dog-like'), referring originally to the ancient Greek school of philosophers known for their contempt for conventionality and focus on simple virtue. The modern sense (skeptical of others' motives) emerged later.",
  "SINCE":"Late 16th century (philosophical sense); Mid-18th century (modern skeptical sense)",
  "MEANINGS":[
    {
      "PATTERN":"[sb] is cynical [about sth]",
      "POS":"adj",
      "POS_TIP":"adjective",
      "TAGS":[
        "core word",
        "common",
        "attitude"
      ],
      "DEF_EN":"Distrustful of human nature and believing that people are motivated only by self-interest; skeptical of sincerity or integrity.",
      "DEF_ZH":"愤世嫉俗的；认为人们的行为都是出于自私动机的；不相信人类真诚或正直的。",
      "SENT_EN":"After years working in the government, he grew completely cynical about politics.",
      "SENT_ZH":"在政府工作多年后，他对政治彻底愤世嫉俗了。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "skeptical",
            "pessimistic",
            "distrustful",
            "jaded",
            "disillusioned"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "optimistic",
            "idealistic",
            "naive",
            "trusting"
          ]
        }
      ]
    },
    {
      "PATTERN":"a cynical act/remark",
      "POS":"adj",
      "POS_TIP":"adjective",
      "TAGS":[
        "descriptive",
        "critical"
      ],
      "DEF_EN":"Expressing contemptuous disbelief, especially regarding generally accepted standards of honesty or morality, often showing self-serving motives.",
      "DEF_ZH":"冷嘲热讽的；表现出蔑视或不相信道德标准的，常指自私自利的行为。",
      "SENT_EN":"The advertisement was criticized as a cynical attempt to exploit public fears.",
      "SENT_ZH":"这则广告被批评为一种冷酷无耻的企图，旨在利用公众的恐惧。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "contemptuous",
            "sneering",
            "calculating",
            "self-serving"
          ]
        }
      ]
    },
    {
      "PATTERN":"Cynical philosophy",
      "POS":"adj",
      "POS_TIP":"adjective",
      "TAGS":[
        "rare",
        "historical",
        "philosophy"
      ],
      "DEF_EN":"Relating to or characteristic of the Cynics, an ancient Greek school of philosophers who advocated simplicity and self-sufficiency, often expressing contempt for conventional pleasures.",
      "DEF_ZH":"昔日犬儒主义者的；与古希腊犬儒学派相关的。",
      "SENT_EN":"The Cynical doctrine emphasized living in accordance with nature and rejecting societal norms.",
      "SENT_ZH":"犬儒主义的教义强调依循自然生活并拒绝社会规范。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Stoic",
            "Diogenes"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General/Formal"
}