{
  "WORD":"diploma",
  "IPA":"/dɪˈploʊmə/",
  "CONJUGATES":"diplomas | diplomata (rare)",
  "ETYMOLOGY":"From Latin 'diploma' (a letter of recommendation, official document), from Greek 'diploma' (a license, twin folding), derived from 'diploun' (to double, fold), from 'di-' (twice) + 'ploun' (to fold). Refers to the ancient practice of writing official documents on two tablets or sheets of metal/parchment that were folded together.",
  "SINCE":"Mid-17th century (in the modern educational sense)",
  "MEANINGS":[
    {
      "PATTERN":"receive a diploma",
      "POS":"n",
      "POS_TIP":"countable noun",
      "TAGS":[
        "core word",
        "education",
        "official"
      ],
      "DEF_EN":"A document issued by an educational institution (like a school, college, or university) certifying that the recipient has successfully completed a particular course of study or has been granted a degree.",
      "DEF_ZH":"由教育机构（如学校、学院或大学）颁发的证明接收者已成功完成特定学业课程或被授予学位的证书或文凭。",
      "SENT_EN":"After years of hard work, she finally received her medical diploma.",
      "SENT_ZH":"经过多年的努力，她终于获得了她的医学文凭。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "certificate",
            "degree",
            "qualification",
            "scroll"
          ]
        }
      ]
    },
    {
      "PATTERN":"complete a diploma [in sth]",
      "POS":"n",
      "POS_TIP":"countable noun",
      "TAGS":[
        "common",
        "academic",
        "qualification"
      ],
      "DEF_EN":"A course of study, typically shorter than a full bachelor's degree, which leads to the award of a diploma; often focused on vocational or professional training.",
      "DEF_ZH":"一种学业课程，通常比完整的学士学位课程短，完成后可获得文凭；通常侧重于职业或专业培训。",
      "SENT_EN":"He enrolled in a one-year diploma program in digital marketing.",
      "SENT_ZH":"他报名参加了一个为期一年的数字营销文凭课程。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "associate's degree",
            "vocational training",
            "certificate course"
          ]
        }
      ]
    },
    {
      "PATTERN":"an ancient diploma",
      "POS":"n",
      "POS_TIP":"countable noun",
      "TAGS":[
        "rare",
        "historical",
        "formal"
      ],
      "DEF_EN":"(Historical) An official document or charter, especially one issued by a sovereign or high authority, granting a privilege, right, or honor.",
      "DEF_ZH":"（历史）一份官方文件或特许状，特别是君主或高级当局颁发的，授予特权、权利或荣誉的文件。",
      "SENT_EN":"The museum exhibited a bronze military diploma from the Roman Empire.",
      "SENT_ZH":"博物馆展出了一份来自罗马帝国的青铜军事证书。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "charter",
            "patent"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Academic, General"
}