{
  "WORD":"dresser",
  "IPA":"/ˈdrɛsər/",
  "CONJUGATES":"dresser | dressers",
  "ETYMOLOGY":"From the verb 'dress' (meaning to arrange, prepare, or clothe) + the suffix '-er' (denoting an agent or instrument). The earliest meaning referred to a person who dresses or arranges things; later extended to furniture for arranging clothes or food.",
  "SINCE":"Late 14th century (for a person who dresses); mid-17th century (for a piece of furniture for clothes)",
  "MEANINGS":[
    {
      "PATTERN":"[sth] dresser",
      "POS":"n",
      "POS_TIP":"noun: a word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), or to name a particular one of these (proper noun).",
      "TAGS":[
        "core word",
        "common",
        "furniture"
      ],
      "DEF_EN":"A piece of furniture, typically with drawers and often a mirror, used for storing clothes and personal items.",
      "DEF_ZH":"一种通常带有抽屉和镜子的家具，用于存放衣物和个人物品。",
      "SENT_EN":"She carefully folded her sweaters and placed them in the dresser drawers.",
      "SENT_ZH":"她小心翼翼地叠好毛衣，放进了衣柜的抽屉里。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "chest of drawers",
            "bureau"
          ]
        },
        {
          "T":"related",
          "V":[
            "wardrobe"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sb] dresser",
      "POS":"n",
      "POS_TIP":"noun: a word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), or to name a particular one of these (proper noun).",
      "TAGS":[
        "less common",
        "profession",
        "theatre term"
      ],
      "DEF_EN":"A person whose job is to help actors or models dress for performances or shows; or more generally, a person who dresses in a particular way.",
      "DEF_ZH":"帮助演员或模特为表演或演出穿衣的人；或泛指穿着特定风格的人。",
      "SENT_EN":"The stage manager thanked the dresser for the quick costume change.",
      "SENT_ZH":"舞台监督感谢服装师迅速完成了服装更换。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "stylist",
            "wardrobe assistant"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sth] dresser",
      "POS":"n",
      "POS_TIP":"noun: a word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), or to name a particular one of these (proper noun).",
      "TAGS":[
        "British English",
        "regional",
        "historical",
        "kitchen furniture"
      ],
      "DEF_EN":"(British English) A piece of kitchen furniture, typically with shelves above a base of cupboards or drawers, used for storing crockery and food.",
      "DEF_ZH":"（英式英语）一种厨房家具，通常上部有架子，下部是碗柜或抽屉，用于存放碗碟和食物。",
      "SENT_EN":"The antique Welsh dresser was laden with ceramic plates and bowls.",
      "SENT_ZH":"古老的威尔士餐具柜上摆满了陶瓷盘子和碗。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "sideboard",
            "cupboard"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Commonly used in everyday language for the furniture meaning; the 'person' meaning is specific to certain contexts like theatre; the 'kitchen furniture' meaning is primarily British English."
}