{
  "WORD":"aesthetic",
  "IPA":"/æsˈθɛtɪk/",
  "CONJUGATES":"aesthetically (adv) | aesthetician (n) | aesthetics (n, plural/study of)",
  "ETYMOLOGY":"From Greek aisthētikós ('perceptive, sensitive'), from aisthánesthai ('to perceive, sense'). Coined in German (ästhetisch) by Alexander Baumgarten in 1735 to refer to the theory of sensory perception, later specifically applied to the study of beauty. The spelling 'esthetic' is a common alternative, especially in American English.",
  "SINCE":"Mid-18th century",
  "MEANINGS":[
    {
      "PATTERN":"aesthetic [adj] (appeal/value)",
      "POS":"adj",
      "POS_TIP":"adjective",
      "TAGS":[
        "core word",
        "formal",
        "art"
      ],
      "DEF_EN":"Concerned with beauty or the appreciation of beauty; relating to the branch of philosophy dealing with the nature of art, beauty, and taste.",
      "DEF_ZH":"美学的；审美的；关于艺术、美和品味的欣赏或哲学的。",
      "SENT_EN":"The building was designed to maximize both practical function and aesthetic appeal.",
      "SENT_ZH":"这座建筑的设计旨在最大限度地兼顾实用功能和审美吸引力。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "artistic",
            "beautiful",
            "pleasing",
            "elegant"
          ]
        }
      ]
    },
    {
      "PATTERN":"aesthetic [adj] (design choice)",
      "POS":"adj",
      "POS_TIP":"adjective",
      "TAGS":[
        "common",
        "modern usage",
        "design"
      ],
      "DEF_EN":"Pertaining to the external appearance or visual style of something, often considered separately from practical function.",
      "DEF_ZH":"视觉上的；外观上的；关乎风格的（通常与实用功能区分开）。",
      "SENT_EN":"They made a purely aesthetic change to the website's font.",
      "SENT_ZH":"他们对网站的字体做了一个纯粹的视觉美观上的改变。",
      "RELATED":[]
    },
    {
      "PATTERN":"an aesthetic [n] / the aesthetics [n] (of a culture/movement)",
      "POS":"n",
      "POS_TIP":"countable noun or plural noun (used with singular verb when referring to the study)",
      "TAGS":[
        "formal",
        "philosophy",
        "technical"
      ],
      "DEF_EN":"A set of principles underlying and guiding the work of a particular artist or artistic movement; a particular taste for or approach to beauty.",
      "DEF_ZH":"审美观；美学原理；（某人或某流派的）风格或艺术原则。",
      "SENT_EN":"Her photography favors a dark, moody aesthetic that contrasts sharply with mainstream commercial work.",
      "SENT_ZH":"她的摄影偏爱一种黑暗、情绪化的审美风格，这与主流商业作品形成鲜明对比。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "beauty",
            "style",
            "design",
            "taste"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Formal and academic, but widely used in common discussions regarding design, art, and lifestyle."
}