{
  "WORD":"fantasy",
  "IPA":"/ˈfæntəsi/",
  "CONJUGATES":"fantasies",
  "ETYMOLOGY":"From Old French fantasie, via Latin phantasia, from Greek phantasia (appearance, imagination), derived from phantazein (to make visible).",
  "SINCE":"c. 1300s",
  "MEANINGS":[
    {
      "PATTERN":"fantasy",
      "POS":"n",
      "POS_TIP":"noun",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"The power or process of creating mental images, especially those that are highly imaginative, improbable, or based on wishful thinking.",
      "DEF_ZH":"想象力；幻想（尤指不可能实现或渴望实现的心理图像或过程）",
      "SENT_EN":"He often retreated into a world of pure fantasy to escape the pressures of his job.",
      "SENT_ZH":"他经常沉溺于纯粹的幻想世界，以逃避工作压力。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "imagination",
            "daydream",
            "reverie",
            "illusion"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "reality",
            "actuality"
          ]
        }
      ]
    },
    {
      "PATTERN":"fantasy [genre]",
      "POS":"n",
      "POS_TIP":"noun",
      "TAGS":[
        "genre",
        "literature",
        "art"
      ],
      "DEF_EN":"A genre of imaginative fiction involving magic, supernatural creatures, or medieval settings in a fictional universe, often dealing with themes of good versus evil.",
      "DEF_ZH":"奇幻作品（文学、电影等的一种类型，涉及魔法、神话生物或虚构世界，常用于区分现实）",
      "SENT_EN":"She prefers reading epic fantasy novels over historical fiction.",
      "SENT_ZH":"比起历史小说，她更喜欢阅读史诗奇幻小说。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "sci-fi",
            "mythology",
            "magic",
            "speculative fiction"
          ]
        }
      ]
    },
    {
      "PATTERN":"a fantasy (of [sth])",
      "POS":"n",
      "POS_TIP":"noun",
      "TAGS":[
        "common",
        "aspiration"
      ],
      "DEF_EN":"An improbable but highly desired situation, event, or scenario.",
      "DEF_ZH":"白日梦；奢望；渴望实现的事情或情景",
      "SENT_EN":"Owning a secluded island remains her ultimate fantasy.",
      "SENT_ZH":"拥有一座僻静的岛屿仍然是她最终极的梦想。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "wish",
            "dream",
            "aspiration",
            "craving"
          ]
        }
      ]
    },
    {
      "PATTERN":"fantasy [sth]",
      "POS":"adj",
      "POS_TIP":"adjective (attributive)",
      "TAGS":[
        "attributive",
        "gaming"
      ],
      "DEF_EN":"Relating to or being a type of game where participants manage virtual teams based on the actual performance statistics of professional players.",
      "DEF_ZH":"梦幻的；虚拟的（指基于现实运动员统计数据的体育游戏，如梦幻足球）",
      "SENT_EN":"He spent all afternoon setting up his fantasy baseball league team.",
      "SENT_ZH":"他花了一个下午来组建他的梦幻棒球联盟队伍。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "simulated",
            "virtual"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General usage, common in arts, entertainment, and everyday speech."
}