{
  "WORD":"Friday",
  "IPA":"/ˈfraɪ.deɪ/",
  "CONJUGATES":"Fridays",
  "ETYMOLOGY":"From Old English Frīgedæg, meaning 'day of Frigg'. Frigg was the Norse goddess associated with love, marriage, and fertility, analogous to the Roman goddess Venus, for whom the Latin 'dies Veneris' (day of Venus) was named.",
  "SINCE":"Before 1000 AD",
  "MEANINGS":[
    {
      "PATTERN":"Friday",
      "POS":"n.",
      "POS_TIP":"noun: A word that refers to a person, place, thing, event, substance, or quality.",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"The fifth day of the week, following Thursday and preceding Saturday.",
      "DEF_ZH":"一周的第五天，在星期四之后，星期六之前。",
      "SENT_EN":"I always look forward to Friday evenings.",
      "SENT_ZH":"我总是期待着星期五的晚上。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Thursday",
            "Saturday",
            "weekend",
            "weekday"
          ]
        }
      ]
    },
    {
      "PATTERN":"Black Friday",
      "POS":"n.",
      "POS_TIP":"noun: A word that refers to a person, place, thing, event, substance, or quality.",
      "TAGS":[
        "idiomatic",
        "commerce",
        "common"
      ],
      "DEF_EN":"The Friday after Thanksgiving Day in the United States, widely regarded as the start of the Christmas shopping season, characterized by significant sales and promotional offers from retailers.",
      "DEF_ZH":"美国感恩节之后的星期五，被普遍认为是圣诞购物季的开始，零售商通常会提供大幅折扣和促销活动。",
      "SENT_EN":"Many people start their Christmas shopping on Black Friday.",
      "SENT_ZH":"很多人在黑色星期五开始他们的圣诞购物。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Cyber Monday",
            "Thanksgiving"
          ]
        }
      ]
    },
    {
      "PATTERN":"TGIF (Thank God It's Friday)",
      "POS":"initialism",
      "POS_TIP":"initialism: An abbreviation formed from the initial letters of other words and pronounced as a sequence of letters.",
      "TAGS":[
        "colloquial",
        "common",
        "expression"
      ],
      "DEF_EN":"An expression used to convey relief or joy that the working week has concluded and the weekend is about to begin.",
      "DEF_ZH":"一种表达解脱或喜悦的说法，表示工作周已经结束，周末即将来临。",
      "SENT_EN":"\"TGIF!\" she exclaimed as she left the office.",
      "SENT_ZH":"“谢天谢地，星期五了！”她离开办公室时喊道。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "weekend",
            "relaxation"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Common usage in daily conversation, calendars, and commerce."
}