{
  "WORD":"friendship",
  "IPA":"/ˈfrɛndʃɪp/",
  "CONJUGATES":"friendships (plural)",
  "ETYMOLOGY":"From Middle English frendshipe, from Old English frēondscipe (“state of being a friend”), equivalent to friend +‎ -ship.",
  "SINCE":"Old English (circa 10th century)",
  "MEANINGS":[
    {
      "PATTERN":"[sb]'s friendship | the friendship between [sb] and [sb]",
      "POS":"n",
      "POS_TIP":"Noun, typically uncountable when referring to the quality; countable when referring to a specific relationship.",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"The state of being friends; a close, often lasting relationship between two people based on mutual affection, respect, trust, and common interests.",
      "DEF_ZH":"友谊；朋友关系；基于相互喜爱、尊重、信任和共同兴趣的亲密关系。",
      "SENT_EN":"Their childhood friendship endured despite living on opposite sides of the country.",
      "SENT_ZH":"尽管他们住在国家的两端，但他们的童年友谊依然持续着。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "camaraderie",
            "companionship",
            "fellowship",
            "amity"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "enmity",
            "hostility",
            "antagonism"
          ]
        }
      ]
    },
    {
      "PATTERN":"friendship with [sth/sb]",
      "POS":"n",
      "POS_TIP":"Noun, referring to goodwill or friendly relations, often used formally or diplomatically.",
      "TAGS":[
        "formal",
        "diplomatic"
      ],
      "DEF_EN":"A state of cooperation and mutual goodwill between nations, groups, or institutions.",
      "DEF_ZH":"（国家、团体或机构间的）友好关系；邦交。",
      "SENT_EN":"The two nations celebrated fifty years of peace and friendship.",
      "SENT_ZH":"两国庆祝了五十年的和平与友好关系。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "accord",
            "alliance",
            "rapprochement"
          ]
        }
      ]
    },
    {
      "PATTERN":"make friendship",
      "POS":"n",
      "POS_TIP":"Noun, used poetically or in older literature.",
      "TAGS":[
        "old word",
        "rare"
      ],
      "DEF_EN":"An act of kindness or favor shown to another person as a gesture of goodwill.",
      "DEF_ZH":"友好之举；善意行为（旧用法或诗意用法）。",
      "SENT_EN":"He offered a small friendship to the needy traveler.",
      "SENT_ZH":"他对那位贫困的旅行者伸出了援助之手（表达善意）。",
      "RELATED":[]
    }
  ],
  "REGISTER":"Commonly used in daily conversation, literature, and formal diplomatic communication."
}