{
  "WORD":"fusion",
  "IPA":"/fjuːʒən/",
  "CONJUGATES":"fusions",
  "ETYMOLOGY":"From Latin fūsio (a pouring, melting), from fundere (to pour, melt). Adopted into Middle English via Old French fusion.",
  "SINCE":"c. 1400",
  "MEANINGS":[
    {
      "PATTERN":"fusion [of sth]",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"The process or result of joining two or more things together to form a single entity, often by melting or blending.",
      "DEF_ZH":"融合；熔合；结合；合并。",
      "SENT_EN":"The complete fusion of the two political parties took several years to achieve.",
      "SENT_ZH":"这两个政党的完全合并花费了数年时间才实现。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "merger",
            "combination",
            "amalgamation",
            "synthesis"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "separation",
            "division",
            "fission"
          ]
        }
      ]
    },
    {
      "PATTERN":"nuclear fusion",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "scientific",
        "technical"
      ],
      "DEF_EN":"A nuclear reaction in which atomic nuclei of low atomic number combine to form a heavier nucleus with the release of energy.",
      "DEF_ZH":"（原子）核聚变（一种释放大量能量的核反应）。",
      "SENT_EN":"Research into controlled fusion promises a massive, clean source of energy for the future.",
      "SENT_ZH":"可控核聚变的研究有望为未来提供巨大的清洁能源。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "fission",
            "plasma",
            "thermonuclear"
          ]
        }
      ]
    },
    {
      "PATTERN":"fusion cuisine/music/style",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "arts",
        "culinary"
      ],
      "DEF_EN":"A blend of different styles, especially in cooking, music, or visual arts, combining elements from varied traditions.",
      "DEF_ZH":"混合风格；跨界风格（尤指食物、音乐、艺术中不同流派的结合）。",
      "SENT_EN":"They run a popular fusion restaurant specializing in Thai and Italian dishes.",
      "SENT_ZH":"他们经营着一家广受欢迎的融合餐厅，专营泰式和意大利式菜肴。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "hybrid",
            "eclectic",
            "crossover"
          ]
        }
      ]
    },
    {
      "PATTERN":"bone/spinal fusion",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "medical",
        "technical"
      ],
      "DEF_EN":"The natural or surgical joining of adjacent bones or tissues, often used to stabilize joints like the spine.",
      "DEF_ZH":"（骨骼、组织）融合术；骨接合（常用于稳定脊柱等关节）。",
      "SENT_EN":"He underwent a lumbar fusion after years of chronic back pain.",
      "SENT_ZH":"在遭受多年慢性背痛后，他接受了腰椎融合术。",
      "RELATED":[]
    }
  ],
  "REGISTER":"formal to general academic and specialized fields"
}