{
  "WORD":"ghetto",
  "IPA":"/ˈɡɛtoʊ/",
  "CONJUGATES":"ghettos (noun plural) | ghettoes (verb, 3rd person singular present) | ghettoing (verb, present participle) | ghettoed (verb, past tense/past participle)",
  "ETYMOLOGY":"From Italian 'ghetto', originally the name of the quarter in Venice to which Jews were restricted, from Venetian 'ghetto' ('foundry'), referring to the site where the first Jewish quarter was established.",
  "SINCE":"17th century",
  "MEANINGS":[
    {
      "PATTERN":"ghetto",
      "POS":"noun",
      "POS_TIP":"A word that refers to a person, place, thing, event, substance, or quality.",
      "TAGS":[
        "core word",
        "historical",
        "sociology"
      ],
      "DEF_EN":"A part of a city, especially a slum area, occupied by a minority group or groups. Historically, this term referred to areas where Jewish people were forced to live.",
      "DEF_ZH":"城市中某个区域，尤指贫民区，由少数民族或群体居住。历史上，特指犹太人被强制居住的区域。",
      "SENT_EN":"The historical ghetto of Venice is a significant landmark.",
      "SENT_ZH":"威尼斯历史上的犹太区是一个重要的地标。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "slum",
            "favela",
            "shantytown"
          ]
        }
      ]
    },
    {
      "PATTERN":"ghetto",
      "POS":"noun",
      "POS_TIP":"A word that refers to a person, place, thing, event, substance, or quality.",
      "TAGS":[
        "common",
        "figurative",
        "derogatory (sometimes)"
      ],
      "DEF_EN":"An isolated or segregated group, community, or area, often implying social or economic disadvantage, or a self-contained, often restrictive, environment.",
      "DEF_ZH":"一个被隔离或孤立的群体、社区或区域，常暗示社会或经济上的劣势；或指一个自我封闭、常有局限性的环境。",
      "SENT_EN":"Many talented artists feel trapped in a creative ghetto, unable to reach a wider audience.",
      "SENT_ZH":"许多有才华的艺术家感到被困在一个创意贫民区里，无法接触到更广泛的受众。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "enclave",
            "bubble",
            "isolated community"
          ]
        }
      ]
    },
    {
      "PATTERN":"ghetto [sb/sth]",
      "POS":"verb",
      "POS_TIP":"A verb that describes an action and takes a direct object.",
      "TAGS":[
        "less common",
        "transitive"
      ],
      "DEF_EN":"To confine or restrict (a group of people or a quality) to a particular area or sphere; to marginalize.",
      "DEF_ZH":"将（一群人或一种特质）局限于某个特定区域或范围；使边缘化。",
      "SENT_EN":"The system tends to ghetto the poor into specific neighborhoods.",
      "SENT_ZH":"该制度倾向于将穷人限制在特定的社区。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "segregate",
            "confine",
            "isolate",
            "marginalize",
            "ghettoize"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Formal in historical/sociological contexts; informal/colloquial when used metaphorically or as a verb. Can be derogatory."
}