{
  "WORD":"glamour",
  "IPA":"/ˈɡlæmər/",
  "CONJUGATES":"glamours",
  "ETYMOLOGY":"From Scottish glamer (around 1720s), an alteration of English grammar, influenced by glimmer. Originally meaning 'magic, enchantment, spell', particularly one that deludes the eye. This evolved from the sense of 'gramarye' (occult learning, magic), which was a corruption of 'grammar', as literacy and learning were often associated with magical powers in earlier times.",
  "SINCE":"Early 18th century (modern sense)",
  "MEANINGS":[
    {
      "PATTERN":"the glamour of [sth/sb]",
      "POS":"n",
      "POS_TIP":"Noun: A word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), or to name a particular one of these (proper noun).",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"The quality of fascinating or alluring charm and attractiveness, often associated with wealth, celebrity, fashion, or exotic places.",
      "DEF_ZH":"迷人或诱惑人的魅力和吸引力，常与财富、名望、时尚或异国情调相关。",
      "SENT_EN":"She was captivated by the old Hollywood glamour.",
      "SENT_ZH":"她被旧好莱坞的魅力所吸引。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "allure",
            "charm",
            "fascination",
            "attractiveness",
            "enchantment",
            "charisma",
            "pizzazz"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "ugliness",
            "drabness",
            "dullness",
            "plainness"
          ]
        }
      ]
    },
    {
      "PATTERN":"under a glamour",
      "POS":"n",
      "POS_TIP":"Noun: A word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), or to name a particular one of these (proper noun).",
      "TAGS":[
        "old word",
        "literary",
        "rare"
      ],
      "DEF_EN":"An enchanting spell or illusion, often causing one to perceive things as more attractive or beautiful than they really are.",
      "DEF_ZH":"一种迷人的魔法或幻觉，常使人觉得事物比实际更具吸引力或美丽。",
      "SENT_EN":"The sorcerer cast a glamour over the ancient ruins, making them appear as a magnificent castle.",
      "SENT_ZH":"巫师对古老的废墟施了魔法，使它们看起来像一座宏伟的城堡。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "spell",
            "enchantment",
            "illusion",
            "charm",
            "magic"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General, often used in fashion, entertainment, or celebrity contexts. The second meaning is primarily literary or archaic."
}