{
  "WORD":"graphics",
  "IPA":"/ˈɡræfɪks/",
  "CONJUGATES":"plural noun; singular: graphic (less common in this specific collective sense)",
  "ETYMOLOGY":"From Greek graphikos 'belonging to drawing, pictorial', from graphein 'to write, draw'. Used in English from the late 17th century for 'graphic' (adj.), and as a collective noun 'graphics' specifically referring to visual material, especially in computing, from the mid-20th century.",
  "SINCE":"Mid-20th century (in the sense of visual displays)",
  "MEANINGS":[
    {
      "PATTERN":"graphics",
      "POS":"n. plural",
      "POS_TIP":"A noun (n.) is a word that names something, such as a person, place, thing, or idea. 'Plural' indicates it refers to more than one item, though 'graphics' is often treated as a collective or uncountable noun referring to the field or visual content as a whole.",
      "TAGS":[
        "core word",
        "common",
        "technology",
        "art",
        "design"
      ],
      "DEF_EN":"Visual images or designs displayed on a screen or piece of paper, especially those created or manipulated by computer.",
      "DEF_ZH":"在屏幕或纸张上显示的视觉图像或设计，尤指通过计算机创建或处理的图形。",
      "SENT_EN":"The game's graphics are incredibly realistic and immersive.",
      "SENT_ZH":"这款游戏的画面令人难以置信地真实且富有沉浸感。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "visuals",
            "imagery",
            "illustrations",
            "artwork"
          ]
        },
        {
          "T":"related",
          "V":[
            "computer graphics",
            "graphic design",
            "animation",
            "rendering",
            "visual effects"
          ]
        }
      ]
    },
    {
      "PATTERN":"graphics",
      "POS":"n. plural",
      "POS_TIP":"A noun (n.) is a word that names something, such as a person, place, thing, or idea. 'Plural' indicates it refers to more than one item, though 'graphics' is often treated as a collective or uncountable noun referring to the field or visual content as a whole.",
      "TAGS":[
        "technical",
        "academic",
        "common"
      ],
      "DEF_EN":"The art or science of drawing, illustrating, or designing visual content, particularly with computer-generated images; the field of study dedicated to this.",
      "DEF_ZH":"绘画、插画或设计视觉内容的艺术或科学，尤其指计算机生成的图像；致力于此的学科领域。",
      "SENT_EN":"She decided to major in graphics, hoping to work in the animation industry.",
      "SENT_ZH":"她决定主修图形学，希望能进入动画行业工作。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "graphic design",
            "computer science",
            "visual arts",
            "digital art"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Commonly used in everyday conversation, technology, art, and design contexts."
}