{
  "WORD":"gymnasium",
  "IPA":"/dʒɪmˈneɪziəm/",
  "CONJUGATES":"plural: gymnasiums | plural: gymnasia",
  "ETYMOLOGY":"From Latin gymnasium, from Ancient Greek gymnasion (γυμνάσιον, 'place for bodily exercise'), derived from gymnos (γυμνός, 'naked'), reflecting the practice of exercising nude in ancient times.",
  "SINCE":"Late 16th century (c. 1590)",
  "MEANINGS":[
    {
      "PATTERN":"[sth]",
      "POS":"n",
      "POS_TIP":"noun",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"A large room or building equipped for physical exercise, typically for indoor sports, fitness training, and weightlifting. (Often shortened to 'gym').",
      "DEF_ZH":"用于体育锻炼的大型房间或建筑，通常配备室内运动、健身训练和举重设备。（常简称为“gym”）",
      "SENT_EN":"The hotel has a well-equipped gymnasium open to all guests.",
      "SENT_ZH":"这家酒店设有一个设备齐全的体育馆，对所有住客开放。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "gym",
            "health club",
            "fitness center"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sth]",
      "POS":"n",
      "POS_TIP":"noun",
      "TAGS":[
        "regional",
        "educational"
      ],
      "DEF_EN":"(Chiefly European, especially German and Dutch context) A type of selective secondary school that prepares students for higher academic education at a university.",
      "DEF_ZH":"（主要用于欧洲，尤其是在德国和荷兰）一种精英型中学，旨在为学生进入大学接受高等教育做准备。",
      "SENT_EN":"Students must pass rigorous exams to enter a Gymnasium in many parts of Germany.",
      "SENT_ZH":"在德国的许多地区，学生必须通过严格的考试才能进入文理中学（Gymnasium）。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "lyceum",
            "secondary school",
            "high school"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sth]",
      "POS":"n",
      "POS_TIP":"noun",
      "TAGS":[
        "historical",
        "ancient"
      ],
      "DEF_EN":"In ancient Greece, a public facility for the training of athletes, especially for track and field, and often serving as a center for philosophical discussion and general education.",
      "DEF_ZH":"在古希腊，用于训练运动员（尤其是田径项目）的公共设施，通常也作为哲学讨论和通识教育的中心。",
      "SENT_EN":"The ancient Greek gymnasium was a combination of a wrestling ground and a school.",
      "SENT_ZH":"古希腊的体育馆是摔跤场和学校的结合体。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "academy",
            "palaestra"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Formal/General"
}