{
  "WORD":"hijack",
  "IPA":"/ˈhaɪdʒæk/",
  "CONJUGATES":"hijacks | hijacked | hijacking",
  "ETYMOLOGY":"Originating in the US in the early 20th century, possibly from 'highway' + 'jack' (meaning 'man' or 'a person who takes') or from the robber's command 'High, Jack!' to raise hands during a holdup, often associated with truck or bootleg liquor robbery.",
  "SINCE":"c. 1920s",
  "MEANINGS":[
    {
      "PATTERN":"hijack [sth]",
      "POS":"vtr",
      "POS_TIP":"transitive verb: a verb that requires a direct object to complete its meaning",
      "TAGS":[
        "core word",
        "common",
        "crime"
      ],
      "DEF_EN":"To illegally seize control of a vehicle, aircraft, or ship during its journey, especially by force or threat of force.",
      "DEF_ZH":"非法劫持（车辆、飞机、船只等），尤指在旅途中通过武力或武力威胁。",
      "SENT_EN":"The terrorists attempted to hijack the plane on its way to New York.",
      "SENT_ZH":"恐怖分子试图劫持飞往纽约的飞机。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "seize",
            "commandeering",
            "abduct",
            "take over"
          ]
        }
      ]
    },
    {
      "PATTERN":"hijack [sth]",
      "POS":"vtr",
      "POS_TIP":"transitive verb: a verb that requires a direct object to complete its meaning",
      "TAGS":[
        "common",
        "figurative"
      ],
      "DEF_EN":"To take control of (a meeting, event, or process) and direct it to one's own advantage, often without permission or against the original intent.",
      "DEF_ZH":"劫持、操控（会议、事件或过程），使其为己所用，常指未经允许或违背初衷。",
      "SENT_EN":"He tried to hijack the meeting to promote his own agenda, ignoring others' contributions.",
      "SENT_ZH":"他试图劫持会议来推销自己的议程，无视他人的贡献。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "appropriate",
            "usurp",
            "co-opt",
            "subvert"
          ]
        }
      ]
    },
    {
      "PATTERN":"a hijack",
      "POS":"n",
      "POS_TIP":"noun: a word that refers to a person, place, thing, idea, or quality",
      "TAGS":[
        "common",
        "crime"
      ],
      "DEF_EN":"An act of illegally seizing control of a vehicle, aircraft, or ship.",
      "DEF_ZH":"劫持（车辆、飞机、船只等）的行为。",
      "SENT_EN":"The police successfully prevented a potential hijack at the airport.",
      "SENT_ZH":"警方在机场成功阻止了一次潜在的劫持事件。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "seizure",
            "commandeering",
            "abduction"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Commonly used in news, reports, and discussions relating to crime, security, or taking control of situations."
}