{
  "WORD":"humanism",
  "IPA":"/ˈhjuːmənɪzəm/",
  "CONJUGATES":"",
  "ETYMOLOGY":"From French 'humanisme' (1806), from 'humain' (from Latin 'humanus' 'human') + '-isme' '-ism'. Originally referring to the study of classical antiquity in the Renaissance, later extended to the broader philosophical stance.",
  "SINCE":"Early 19th century",
  "MEANINGS":[
    {
      "PATTERN":"[U] humanism",
      "POS":"noun",
      "POS_TIP":"U: Uncountable noun",
      "TAGS":[
        "core word",
        "historical",
        "academic"
      ],
      "DEF_EN":"A philosophical and ethical stance that emphasizes the value and agency of human beings, individually and collectively, and generally prefers critical thinking and evidence (rationalism and empiricism) over established doctrine or faith (fideism). In the Renaissance, it specifically referred to a cultural and intellectual movement stressing classical studies and human achievement.",
      "DEF_ZH":"一种强调人的价值和能动性，提倡批判性思维和实证（理性主义和经验主义）而非既定教条或信仰（信仰主义）的哲学和伦理立场。在文艺复兴时期，特指一种强调古典学和人类成就的文化和思想运动。",
      "SENT_EN":"Renaissance humanism revived interest in ancient Greek and Roman thought.",
      "SENT_ZH":"文艺复兴时期的人文主义复兴了对古希腊和罗马思想的兴趣。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Renaissance",
            "Classicism",
            "Secularism"
          ]
        }
      ]
    },
    {
      "PATTERN":"[U] humanism",
      "POS":"noun",
      "POS_TIP":"U: Uncountable noun",
      "TAGS":[
        "core word",
        "philosophical",
        "modern",
        "secular"
      ],
      "DEF_EN":"A rationalist outlook or system of thought attaching prime importance to human rather than divine or supernatural matters. Often explicitly non-religious, emphasizing ethics and justice based on human reason.",
      "DEF_ZH":"一种理性主义的观点或思想体系，将人的事务而非神圣或超自然事务置于首位。通常明确地非宗教，强调基于人类理性的伦理和正义。",
      "SENT_EN":"Many modern humanists advocate for a morality based on empathy and reason.",
      "SENT_ZH":"许多现代人文主义者主张一种基于同理心和理性的道德观。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "secularism",
            "rationalism"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "theism",
            "supernaturalism"
          ]
        },
        {
          "T":"related",
          "V":[
            "Atheism",
            "Agnosticism",
            "Enlightenment"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Formal, academic, philosophical"
}