{
  "WORD":"humanist",
  "IPA":"/ˈhjuːmənɪst/",
  "CONJUGATES":"humanists (plural) | humanistic (adjective)",
  "ETYMOLOGY":"From Latin 'humanus' (human), via 'humanism' (coined in the 19th century to refer to the intellectual movement of the Renaissance), ultimately from Medieval Latin 'humanista' (a student of humaniores – classical literature), which emerged in the 15th century.",
  "SINCE":"Late 15th Century",
  "MEANINGS":[
    {
      "PATTERN":"[a humanist]",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "core word",
        "common",
        "philosophy",
        "religion"
      ],
      "DEF_EN":"A person who believes in or practices humanism, an outlook or system of thought attaching prime importance to human rather than divine or supernatural matters. Humanist beliefs stress the potential value and goodness of human beings, emphasize common human needs, and seek solely rational ways of solving human problems.",
      "DEF_ZH":"相信或奉行人本主义或人文主义的人。人本主义是一种思想体系，将人类而非神性或超自然事物置于首位。人本主义信仰强调人类的潜在价值和善良，重视普遍的人类需求，并寻求纯粹理性的方式来解决人类问题。",
      "SENT_EN":"As a humanist, she advocates for a society based on reason, ethics, and compassion.",
      "SENT_ZH":"作为一名人本主义者，她倡导一个基于理性、伦理和同情的社会。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "humanism",
            "rationalist",
            "secularist",
            "agnostic",
            "atheist"
          ]
        }
      ]
    },
    {
      "PATTERN":"[a Renaissance humanist]",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "historical",
        "academic",
        "Renaissance"
      ],
      "DEF_EN":"(Historical) A scholar or student of the humanities, especially during the Renaissance, who focused on classical literature, rhetoric, and art as a source of understanding human nature and promoting civic virtue.",
      "DEF_ZH":"（历史）在文艺复兴时期尤其指专注于古典文学、修辞学和艺术的人文科学学者或学生，他们将其视为理解人性、促进公民美德的源泉。",
      "SENT_EN":"Renaissance humanists rediscovered and translated many ancient Greek and Roman texts.",
      "SENT_ZH":"文艺复兴时期的人文主义者重新发现并翻译了许多古希腊和古罗马文献。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "classicist",
            "scholar",
            "philologist"
          ]
        }
      ]
    },
    {
      "PATTERN":"[humanist values]",
      "POS":"adj.",
      "POS_TIP":"adjective",
      "TAGS":[
        "common",
        "philosophy",
        "ethics"
      ],
      "DEF_EN":"Relating to or characteristic of humanism or a humanist, often implying an emphasis on human dignity, freedom, and rational inquiry.",
      "DEF_ZH":"与人本主义或人本主义者相关的或具有其特征的，通常意味着强调人类尊严、自由和理性探究。",
      "SENT_EN":"The school promotes humanist values, encouraging critical thinking and empathy among its students.",
      "SENT_ZH":"这所学校倡导人本主义价值观，鼓励学生培养批判性思维和同理心。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "humanistic"
          ]
        },
        {
          "T":"related",
          "V":[
            "ethical",
            "philosophical",
            "secular"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Formal, Academic, Philosophical, but also used in general discourse when discussing worldviews or educational philosophies."
}