{
  "WORD":"intake",
  "IPA":"/ˈɪnˌteɪk/",
  "CONJUGATES":"intakes",
  "ETYMOLOGY":"From English 'in' and 'take'. The noun sense developed from the verb 'to take in'.",
  "SINCE":"Late 17th century (as a noun)",
  "MEANINGS":[
    {
      "PATTERN":"[sth] intake | an intake of [sth]",
      "POS":"noun",
      "POS_TIP":"A word (other than a pronoun) used to identify any of a class of people, places, or things. Can be countable or uncountable.",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"The amount of food, drink, air, or another substance taken into the body or a system; also, the action or process of taking something in.",
      "DEF_ZH":"摄入量；摄入；吸入（身体或系统摄入的食物、饮料、空气或其他物质的数量；也可指摄入的动作或过程）",
      "SENT_EN":"Monitoring your daily calorie intake is important for health. The engine has a fresh air intake system.",
      "SENT_ZH":"监测您每日的卡路里摄入量对健康很重要。这台发动机有一个新鲜空气吸入系统。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "consumption",
            "absorption",
            "ingestion",
            "inhalation"
          ]
        }
      ]
    },
    {
      "PATTERN":"an intake (for sth)",
      "POS":"noun",
      "POS_TIP":"A word (other than a pronoun) used to identify any of a class of people, places, or things. Countable.",
      "TAGS":[
        "common",
        "technical"
      ],
      "DEF_EN":"A place, channel, or pipe through which water, air, or other substances are drawn into a system, machine, or area.",
      "DEF_ZH":"进水口；进气口；入口（水、空气或其他物质被吸入系统、机器或区域的通道或管道）",
      "SENT_EN":"The river's intake for the power station is located upstream. Make sure the water intake isn't blocked.",
      "SENT_ZH":"发电站的河水进水口位于上游。确保进水口没有堵塞。",
      "RELATED":[]
    },
    {
      "PATTERN":"the intake of [sb/sth] | a new intake",
      "POS":"noun",
      "POS_TIP":"A word (other than a pronoun) used to identify any of a class of people, places, or things. Can be countable or uncountable.",
      "TAGS":[
        "core word",
        "common",
        "formal"
      ],
      "DEF_EN":"The process of admitting or enrolling people or things into an organization, institution, or program; also, the group of people or things admitted.",
      "DEF_ZH":"招收；吸收；新招收的人员（将人员或事物招募或纳入组织、机构或项目的过程；也可指被招收的人员或群体）",
      "SENT_EN":"The university plans to increase its intake of international students next year. The new intake of interns started their training today.",
      "SENT_ZH":"该大学计划明年增加国际学生的招生数量。新一批实习生今天开始了他们的培训。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "admission",
            "enrollment",
            "recruitment",
            "class",
            "cohort"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General, often used in scientific, technical, or administrative contexts."
}