{
  "WORD":"jazz",
  "IPA":"/dʒæz/",
  "CONJUGATES":"jazzes | jazzing | jazzed",
  "ETYMOLOGY":"Origin is highly disputed, possibly first appearing as slang in US West Coast baseball c. 1912. It may be related to earlier slang terms like 'jasm' (pep, vigor) or 'jass' (a term for sexual activity). It was firmly established as the name of the music genre around 1915.",
  "SINCE":"c. 1912",
  "MEANINGS":[
    {
      "PATTERN":"[sth] (music)",
      "POS":"n",
      "POS_TIP":"noun, uncountable",
      "TAGS":[
        "core word",
        "music",
        "common"
      ],
      "DEF_EN":"A type of music of African American origin characterized by improvisation, syncopated rhythms, polyrhythms, and a strong, flexible rhythmic foundation, usually played on brass and woodwind instruments, piano, and drums.",
      "DEF_ZH":"一种起源于非裔美国人的音乐类型，其特点是即兴创作、切分节奏、复节奏以及强大灵活的节奏基础，通常由铜管乐器、木管乐器、钢琴和鼓演奏。",
      "SENT_EN":"They spent the evening listening to smooth jazz at the club.",
      "SENT_ZH":"他们晚上在俱乐部听了柔和的爵士乐。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Blues",
            "Bebop",
            "Swing",
            "Fusion",
            "Dixieland"
          ]
        }
      ]
    },
    {
      "PATTERN":"jazz [sth] up",
      "POS":"vtr | phrasal",
      "POS_TIP":"transitive verb, phrasal (requires an object and particle)",
      "TAGS":[
        "colloquial",
        "action"
      ],
      "DEF_EN":"To make something more lively, interesting, or ornate; to embellish or add flair.",
      "DEF_ZH":"使某物更有活力、更有趣或更华丽；润饰或增加风格。",
      "SENT_EN":"She jazzed up her plain black dress with a colorful silk scarf.",
      "SENT_ZH":"她用一条彩色丝巾来美化她那件朴素的黑色连衣裙。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "enliven",
            "spice up",
            "embellish",
            "liven up"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sth] (informal)",
      "POS":"n",
      "POS_TIP":"noun, uncountable",
      "TAGS":[
        "slang",
        "informal",
        "dated"
      ],
      "DEF_EN":"Trivial or unnecessary talk, matters, or activity; nonsense.",
      "DEF_ZH":"无关紧要的谈话、事务或活动；胡言乱语。",
      "SENT_EN":"I don't need all that technical jazz; just tell me how to start the computer.",
      "SENT_ZH":"我不需要那些技术性的废话；告诉我怎么启动电脑就行了。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "stuff",
            "nonsense",
            "claptrap"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Widely used across formal and informal contexts, although the usage as 'nonsense' (Meaning 3) is dated slang."
}