{
  "WORD":"law",
  "IPA":"/lɔː/",
  "CONJUGATES":"laws",
  "ETYMOLOGY":"From Old English lagu (from Old Norse lag 'something laid down or fixed'), of Germanic origin, related to 'lay'.",
  "SINCE":"Before 12th century",
  "MEANINGS":[
    {
      "PATTERN":"the law",
      "POS":"noun",
      "POS_TIP":"A word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), often used with 'the' to refer to the system.",
      "TAGS":[
        "core word",
        "common",
        "legal system"
      ],
      "DEF_EN":"The system of rules which a particular country or community recognizes as regulating the actions of its members and which it may enforce by the imposition of penalties.",
      "DEF_ZH":"某国家或社区认可并强制执行的，规范其成员行为的规则体系。",
      "SENT_EN":"Respect for the law is essential for a stable society.",
      "SENT_ZH":"尊重法律对于稳定的社会至关重要。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "legislation",
            "jurisprudence",
            "constitution",
            "code"
          ]
        },
        {
          "T":"related",
          "V":[
            "justice",
            "government",
            "judiciary",
            "police"
          ]
        }
      ]
    },
    {
      "PATTERN":"a law | laws",
      "POS":"noun",
      "POS_TIP":"A word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), here referring to a countable, specific rule.",
      "TAGS":[
        "common",
        "legal",
        "specific rule"
      ],
      "DEF_EN":"An individual rule, typically one of a set of rules, prescribed by authority for the ordering of a society.",
      "DEF_ZH":"由权威机构为社会秩序而制定的一项具体规则。",
      "SENT_EN":"Parliament passed a new law to protect endangered species.",
      "SENT_ZH":"议会通过了一项新法律来保护濒危物种。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "statute",
            "act",
            "ordinance",
            "decree",
            "regulation",
            "rule"
          ]
        }
      ]
    },
    {
      "PATTERN":"law (as a subject/profession)",
      "POS":"noun",
      "POS_TIP":"A word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), here referring to a field of study or a profession.",
      "TAGS":[
        "common",
        "academic",
        "profession"
      ],
      "DEF_EN":"The study of the system of rules of a particular country or community, or the profession of practicing these rules.",
      "DEF_ZH":"对某个国家或社区规则体系的研究，或从事这些规则的职业。",
      "SENT_EN":"She decided to study law after graduating from high school.",
      "SENT_ZH":"高中毕业后她决定学习法律。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "lawyer",
            "legal",
            "barrister",
            "attorney",
            "jurisprudence"
          ]
        }
      ]
    },
    {
      "PATTERN":"a law | the laws of [sth]",
      "POS":"noun",
      "POS_TIP":"A word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), here referring to a scientific or natural principle.",
      "TAGS":[
        "common",
        "scientific",
        "universal truth"
      ],
      "DEF_EN":"A statement of fact, deduced from observation, to the effect that a particular natural or scientific phenomenon always occurs if certain conditions are present.",
      "DEF_ZH":"根据观察得出的事实陈述，表明在特定条件下，某种自然或科学现象总是发生。",
      "SENT_EN":"Newton's laws of motion are fundamental to classical mechanics.",
      "SENT_ZH":"牛顿运动定律是经典力学的基本原理。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "principle",
            "theory",
            "axiom",
            "formula",
            "postulate"
          ]
        },
        {
          "T":"related",
          "V":[
            "science",
            "physics",
            "gravity",
            "thermodynamics"
          ]
        }
      ]
    },
    {
      "PATTERN":"a law | the laws of [sth] (general principle)",
      "POS":"noun",
      "POS_TIP":"A word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), here referring to a general principle or rule of conduct.",
      "TAGS":[
        "common",
        "general principle"
      ],
      "DEF_EN":"A general principle to which all members of a group or all situations of a certain type are subject.",
      "DEF_ZH":"适用于某群体所有成员或某一类所有情况的普遍原则。",
      "SENT_EN":"It's the first law of business: the customer is always right.",
      "SENT_ZH":"这是商业的第一法则：顾客永远是对的。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "maxim",
            "dictate",
            "precept",
            "canon"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Formal, academic, general"
}