{
  "WORD":"liquor",
  "IPA":"/ˈlɪkər/",
  "CONJUGATES":"liquors (n.) | liquors (v.) | liquored | liquoring",
  "ETYMOLOGY":"From Anglo-Norman and Old French licur (liquid, fluid), derived from Latin liquor (fluid, liquid state, moisture), related to liquere (to be liquid).",
  "SINCE":"c. 1300",
  "MEANINGS":[
    {
      "PATTERN":"[sth]",
      "POS":"n. uncount",
      "POS_TIP":"uncountable noun: a noun that does not have a plural form and cannot be counted.",
      "TAGS":[
        "core word",
        "common",
        "alcohol"
      ],
      "DEF_EN":"Strong alcoholic drink, especially distilled spirits (such as whisky, vodka, or gin), as opposed to milder fermented drinks like beer and wine.",
      "DEF_ZH":"烈酒；蒸馏酒（如威士忌、伏特加或杜松子酒等，区别于啤酒或葡萄酒等发酵酒）。",
      "SENT_EN":"The state law prohibits serving liquor after midnight.",
      "SENT_ZH":"州法律禁止在午夜后提供烈酒。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "spirits",
            "hard alcohol",
            "booze"
          ]
        },
        {
          "T":"related",
          "V":[
            "distillate",
            "whisky",
            "vodka"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sth]",
      "POS":"n. count/uncount",
      "POS_TIP":"countable/uncountable noun: a noun that can sometimes be counted and sometimes not.",
      "TAGS":[
        "archaic",
        "technical",
        "culinary"
      ],
      "DEF_EN":"Any liquid substance, especially a broth, cooking juice, or a solution used in industrial processes like dyeing or tanning.",
      "DEF_ZH":"液体；汁液（尤指肉汤、烹饪汁液，或工业流程如染色、鞣革中使用的溶液）。",
      "SENT_EN":"The tanning process involves soaking the hides in a specialized liquor.",
      "SENT_ZH":"鞣革过程包括将生皮浸泡在一种特殊的溶液中。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "liquid",
            "fluid",
            "broth",
            "solution"
          ]
        }
      ]
    },
    {
      "PATTERN":"liquor [sth]",
      "POS":"v. tr",
      "POS_TIP":"transitive verb: a verb that requires a direct object.",
      "TAGS":[
        "rare",
        "technical"
      ],
      "DEF_EN":"To treat or soak something (especially leather) with a liquid or an oily preparation.",
      "DEF_ZH":"用液体或油性制剂处理或浸泡（尤指皮革）。",
      "SENT_EN":"The craftsman carefully liquored the saddle leather to ensure its longevity.",
      "SENT_ZH":"这位工匠小心翼翼地用液体处理马鞍皮革，以确保其耐用性。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "oil",
            "soak",
            "treat"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Common in general conversation and commerce (when referring to alcohol). Technical in industrial contexts."
}