{
  "WORD":"mahogany",
  "IPA":"/məˈhɒɡəni/",
  "CONJUGATES":"",
  "ETYMOLOGY":"From earlier 'mohogony', of uncertain origin, possibly from a Taíno word (an Arawakan language) of the Caribbean, adopted into Spanish and then English in the mid-17th century.",
  "SINCE":"Mid-17th century (c. 1650s)",
  "MEANINGS":[
    {
      "PATTERN":"[sth]",
      "POS":"noun (uncountable)",
      "POS_TIP":"Noun (uncountable) refers to a noun that cannot be counted, such as substances or abstract concepts, and typically does not have a plural form.",
      "TAGS":[
        "core word",
        "common",
        "wood type"
      ],
      "DEF_EN":"A durable, reddish-brown timber, typically from tropical trees, highly valued for its attractive grain and used especially for furniture.",
      "DEF_ZH":"一种耐用、红褐色木材，通常来自热带树木，因其美观的纹理而备受珍视，尤其用于制作家具。",
      "SENT_EN":"The antique desk was crafted from solid mahogany.",
      "SENT_ZH":"这张古董书桌是用实心桃花心木制作的。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "rosewood",
            "teak",
            "cherry"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sth]",
      "POS":"noun",
      "POS_TIP":"Noun refers to a word that names a person, place, thing, or idea.",
      "TAGS":[
        "core word",
        "common",
        "tree"
      ],
      "DEF_EN":"Any of several tropical American trees that yield mahogany wood, especially species of the genus Swietenia.",
      "DEF_ZH":"产桃花心木的几种热带美洲树木中的任何一种，尤其是桃花心木属（Swietenia）的物种。",
      "SENT_EN":"They planted a young mahogany in their garden.",
      "SENT_ZH":"他们在花园里种了一棵小桃花心木树。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Swietenia"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sth]",
      "POS":"noun (uncountable) | adjective",
      "POS_TIP":"Noun (uncountable) refers to a noun that cannot be counted. Adjective refers to a word that describes or modifies a noun or pronoun.",
      "TAGS":[
        "core word",
        "common",
        "color"
      ],
      "DEF_EN":"A rich reddish-brown color.",
      "DEF_ZH":"一种浓郁的红褐色。",
      "SENT_EN":"She had beautiful mahogany hair that shimmered in the sunlight.",
      "SENT_ZH":"她有着一头在阳光下闪烁的漂亮桃花心木色头发。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "auburn",
            "chestnut",
            "sepia"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General"
}