{
  "WORD":"media",
  "IPA":"/ˈmiːdiə/",
  "CONJUGATES":"Noun (Singular): medium | Adjective: medial | Adjective: multimedia",
  "ETYMOLOGY":"From Latin media, the plural form of medium ('middle, central point, means, instrument'). Adopted into English via scientific and technical contexts before becoming widely used for mass communication.",
  "SINCE":"17th century (as plural of medium); mid-20th century (as collective term for communication)",
  "MEANINGS":[
    {
      "PATTERN":"[the] media",
      "POS":"Noun",
      "POS_TIP":"Collective or plural noun",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"The main means of mass communication (broadcasting, publishing, and the internet) regarded collectively; the organizations that provide news and entertainment.",
      "DEF_ZH":"大众传播媒介（如电视、报纸、广播、互联网等）；新闻机构。",
      "SENT_EN":"The news organization faced heavy criticism from social media users.",
      "SENT_ZH":"这家新闻机构面临着社交媒体用户的严厉批评。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "press",
            "journalism",
            "news outlets",
            "communication"
          ]
        },
        {
          "T":"related",
          "V":[
            "multimedia",
            "medium",
            "broadcast"
          ]
        }
      ]
    },
    {
      "PATTERN":"media [of sth]",
      "POS":"Noun",
      "POS_TIP":"Plural noun",
      "TAGS":[
        "technical",
        "formal"
      ],
      "DEF_EN":"The intermediate means or agency by which something is conveyed or achieved (plural of medium).",
      "DEF_ZH":"媒介；手段；方法（medium 的复数形式）。",
      "SENT_EN":"Different teaching media are required to suit various learning styles.",
      "SENT_ZH":"需要不同的教学媒介来适应各种学习风格。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "medium",
            "vehicle",
            "channel"
          ]
        }
      ]
    },
    {
      "PATTERN":"media [in art/science]",
      "POS":"Noun",
      "POS_TIP":"Plural noun",
      "TAGS":[
        "academic",
        "art"
      ],
      "DEF_EN":"In art, the materials or technical means used to express creativity; in science, the environment (such as a culture medium) in which something is cultivated or stored.",
      "DEF_ZH":"（艺术）材料，创作手段；（科学）培养基，介质。",
      "SENT_EN":"Artists often experiment with mixed media, combining paint, photography, and sculpture.",
      "SENT_ZH":"艺术家们经常尝试混合媒介，将绘画、摄影和雕塑结合起来。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "substrate",
            "culture"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Widely used in everyday conversation, academic writing, and political discourse."
}