{
  "WORD":"mercury",
  "IPA":"/ˈmɜːrkjəri/",
  "CONJUGATES":"mercuries (pl.) | mercurial (adj.)",
  "ETYMOLOGY":"From Latin Mercurius, the Roman god (corresponding to Greek Hermes). The name for the element is a translation of its ancient Greek term *hydrargyros* ('water-silver'), which is also the source of the chemical symbol Hg.",
  "SINCE":"c. 1300 (referring to the Roman god/planet); c. 1400 (referring to the element)",
  "MEANINGS":[
    {
      "PATTERN":"[sth]",
      "POS":"Noun (uncountable, mass)",
      "POS_TIP":"An uncountable noun referring to a substance or concept that cannot be counted individually.",
      "TAGS":[
        "Core word",
        "Science",
        "Chemistry"
      ],
      "DEF_EN":"A heavy, silver-white metallic chemical element (symbol Hg) that is unique in being liquid at standard room temperature and pressure; used historically in thermometers and barometers and often known as quicksilver.",
      "DEF_ZH":"一种重质、银白色的金属化学元素（符号Hg），其独特之处在于在标准室温和压力下为液态；历史上用于温度计和气压计，常被称为水银或汞。",
      "SENT_EN":"Due to its toxicity, mercury has largely been phased out of household thermometers.",
      "SENT_ZH":"由于其毒性，水银已在很大程度上被家庭温度计淘汰。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "quicksilver",
            "Hg"
          ]
        },
        {
          "T":"related",
          "V":[
            "thermometer",
            "toxin"
          ]
        }
      ]
    },
    {
      "PATTERN":"Proper Noun",
      "POS":"Noun (Proper)",
      "POS_TIP":"A proper noun, referring to a specific entity, typically capitalized.",
      "TAGS":[
        "Mythology",
        "Proper Noun",
        "Ancient"
      ],
      "DEF_EN":"The Roman god of commerce, communication, travel, and trickery, who served as the messenger of the gods (equivalent to the Greek god Hermes).",
      "DEF_ZH":"罗马神话中的商业、通讯、旅行和欺骗之神，担任众神的信使（对应希腊神赫尔墨斯）。",
      "SENT_EN":"Statues of Mercury often depict him wearing winged sandals and carrying a caduceus.",
      "SENT_ZH":"墨丘利的雕像通常描绘他穿着带翼的凉鞋并手持双蛇杖。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Hermes",
            "Jupiter",
            "Caduceus"
          ]
        }
      ]
    },
    {
      "PATTERN":"Proper Noun",
      "POS":"Noun (Proper)",
      "POS_TIP":"A proper noun, referring to a specific entity, typically capitalized.",
      "TAGS":[
        "Astronomy",
        "Proper Noun"
      ],
      "DEF_EN":"The smallest planet in the solar system and the closest one to the Sun.",
      "DEF_ZH":"太阳系中最小的行星，也是离太阳最近的行星。",
      "SENT_EN":"NASA's Mariner 10 was the first spacecraft to visit Mercury.",
      "SENT_ZH":"美国宇航局的“水手10号”是第一个造访水星的航天器。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Venus",
            "Earth",
            "Solar System"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Standard English, high usage in scientific and astronomical contexts."
}