{
  "WORD":"mustard",
  "IPA":"/ˈmʌstərd/",
  "CONJUGATES":"n. (uncountable for condiment; countable for plants/seeds): mustard | mustards",
  "ETYMOLOGY":"From Old French moustarde, from moust 'must' (fresh grape juice, used as a thinning agent) + -arde. The name comes from the practice of mixing ground mustard seeds with must.",
  "SINCE":"Late 13th century",
  "MEANINGS":[
    {
      "PATTERN":"mustard",
      "POS":"n.uncount",
      "POS_TIP":"uncountable noun: a noun that does not have a plural form and cannot be counted",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"A piquant yellow or brownish-yellow condiment made from the ground seeds of a mustard plant, typically prepared with water, vinegar, or other liquids, and often spices.",
      "DEF_ZH":"一种辛辣的黄色或棕黄色调味品，由芥菜籽磨碎后与水、醋或其他液体（常加香料）制成。",
      "SENT_EN":"He spread a generous amount of mustard on his hot dog.",
      "SENT_ZH":"他在热狗上抹了一大层芥末酱。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "ketchup",
            "mayonnaise",
            "relish",
            "wasabi"
          ]
        }
      ]
    },
    {
      "PATTERN":"mustard | mustards",
      "POS":"n.",
      "POS_TIP":"noun: a word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), or to name a particular one of these (proper noun)",
      "TAGS":[
        "common"
      ],
      "DEF_EN":"A plant of the cabbage family (genus *Brassica* or *Sinapis*), especially one grown for its seeds or edible leaves. Also, the small, round seeds from this plant, used whole or ground as a spice.",
      "DEF_ZH":"十字花科芥菜属植物，尤指因其种子或可食用叶片而种植的植物。也指这种植物的圆形小种子，可整粒或磨碎用作香料。",
      "SENT_EN":"The field was covered in bright yellow mustard flowers.",
      "SENT_ZH":"田野里开满了鲜黄的芥菜花。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "brassica",
            "cabbage",
            "rapeseed"
          ]
        }
      ]
    },
    {
      "PATTERN":"mustard [color]",
      "POS":"adj.",
      "POS_TIP":"adjective: a word naming an attribute of a noun",
      "TAGS":[
        "common"
      ],
      "DEF_EN":"Of a dull yellow or yellowish-brown color, resembling that of mustard.",
      "DEF_ZH":"芥末色的；暗黄色或黄褐色。",
      "SENT_EN":"She bought a stylish mustard coat for the winter.",
      "SENT_ZH":"她买了一件时髦的芥末色大衣过冬。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "yellow",
            "ochre",
            "khaki"
          ]
        }
      ]
    },
    {
      "PATTERN":"cut the mustard",
      "POS":"idiom",
      "POS_TIP":"idiomatic expression: a group of words established by usage as having a meaning not deducible from those of the individual words",
      "TAGS":[
        "idiomatic",
        "common"
      ],
      "DEF_EN":"To meet expectations or reach the required standard; to be good enough.",
      "DEF_ZH":"达到预期或所需标准；胜任；符合要求。",
      "SENT_EN":"His performance just didn't cut the mustard, so he wasn't hired.",
      "SENT_ZH":"他的表现不达标，所以没有被录用。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "be up to scratch",
            "fit the bill",
            "pass muster"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General"
}