{
  "WORD":"Nazi",
  "IPA":"/ˈnɑːtsi/",
  "CONJUGATES":"Nazi (plural: Nazis)",
  "ETYMOLOGY":"From German 'Nationalsozialist' (National Socialist), an abbreviation of 'Nationalsozialistische Deutsche Arbeiterpartei' (National Socialist German Workers' Party).",
  "SINCE":"Early 1920s",
  "MEANINGS":[
    {
      "PATTERN":"[the] Nazi [s]",
      "POS":"n.",
      "POS_TIP":"Noun: A word that refers to a person, place, thing, event, substance, or quality.",
      "TAGS":[
        "historical",
        "political",
        "pejorative",
        "core word"
      ],
      "DEF_EN":"A member of the National Socialist German Workers' Party, led by Adolf Hitler, which controlled Germany from 1933 to 1945.",
      "DEF_ZH":"纳粹党成员，该党由阿道夫·希特勒领导，于1933年至1945年间统治德国。",
      "SENT_EN":"The Nazis were responsible for the systematic persecution and murder of millions of Jews and other minorities during the Holocaust.",
      "SENT_ZH":"纳粹分子在大屠杀期间对数百万犹太人及其他少数民族进行了系统的迫害和谋杀。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "fascist",
            "totalitarian"
          ]
        }
      ]
    },
    {
      "PATTERN":"Nazi [policy/regime/ideology]",
      "POS":"adj.",
      "POS_TIP":"Adjective: A word that describes or modifies a noun or pronoun.",
      "TAGS":[
        "historical",
        "political",
        "pejorative",
        "core word"
      ],
      "DEF_EN":"Of or relating to the National Socialist German Workers' Party or its ideology.",
      "DEF_ZH":"属于或与国家社会主义德国工人党或其意识形态相关的。",
      "SENT_EN":"The Nuremberg Laws were a series of antisemitic and racist laws enacted in Nazi Germany.",
      "SENT_ZH":"纽伦堡法案是纳粹德国颁布的一系列反犹太和种族主义法律。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "fascist",
            "totalitarian"
          ]
        }
      ]
    },
    {
      "PATTERN":"[a] Nazi",
      "POS":"n.",
      "POS_TIP":"Noun: A word that refers to a person, place, thing, event, substance, or quality.",
      "TAGS":[
        "derogatory",
        "informal",
        "offensive",
        "common"
      ],
      "DEF_EN":"(Informal, derogatory) A person who is perceived as excessively authoritarian, dogmatic, or intolerant, especially regarding strict rules or views.",
      "DEF_ZH":"（非正式，贬义）指一个被认为过于独裁、教条主义或不宽容的人，尤其是在严格的规则或观点方面。",
      "SENT_EN":"My old boss was a real grammar Nazi, always correcting every tiny mistake.",
      "SENT_ZH":"我的老老板是个真正的语法纳粹，总是纠正每一个微小的错误。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "tyrant",
            "autocrat",
            "dictator"
          ]
        },
        {
          "T":"related",
          "V":[
            "fascist"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Historical and political discourse; also used informally as a derogatory term for someone perceived as overly strict or authoritarian."
}