{
  "WORD":"nylon",
  "IPA":"/ˈnaɪlɒn/",
  "CONJUGATES":"nylons",
  "ETYMOLOGY":"Coined by chemists at DuPont in the late 1930s, succeeding Wallace Carothers' synthesis of the polymer in 1935. The name is often rumored to be derived from NY (New York) and LON (London), but DuPont officially stated that the name was chosen arbitrarily and was the result of seeking a pronounceable sequence.",
  "SINCE":"1930s (commercially introduced 1939)",
  "MEANINGS":[
    {
      "PATTERN":"nylon",
      "POS":"Uncountable Noun",
      "POS_TIP":"A material name.",
      "TAGS":[
        "Core word",
        "Chemistry",
        "Common"
      ],
      "DEF_EN":"A strong, light-weight, and elastic synthetic polymer (polyamide), used primarily for fabrics, ropes, and various molded plastic products.",
      "DEF_ZH":"尼龙；耐纶；一种坚固、轻盈且有弹性的合成聚合物（聚酰胺），主要用于织物、绳索和各种模塑塑料制品。",
      "SENT_EN":"The mountaineer preferred ropes made of braided nylon for their superior strength and resistance to abrasion.",
      "SENT_ZH":"登山者更喜欢使用编织尼龙绳，因为它具有卓越的强度和耐磨性。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "polyamide",
            "synthetic fiber"
          ]
        },
        {
          "T":"related",
          "V":[
            "polyester",
            "kevlar",
            "lycra"
          ]
        }
      ]
    },
    {
      "PATTERN":"nylons",
      "POS":"Plural Noun",
      "POS_TIP":"Used specifically in the plural to refer to hosiery.",
      "TAGS":[
        "Fashion",
        "Common",
        "Historical"
      ],
      "DEF_EN":"Stockings or tights, especially those originally or traditionally made from nylon fabric.",
      "DEF_ZH":"（尤指女式）尼龙丝袜；连裤袜。",
      "SENT_EN":"During the war, nylons were highly rationed and became a valuable commodity.",
      "SENT_ZH":"战争期间，尼龙丝袜供应量受到严格管制，成为一种贵重商品。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "hosiery",
            "stockings",
            "tights"
          ]
        }
      ]
    },
    {
      "PATTERN":"nylon [sth]",
      "POS":"Attributive Adjective",
      "POS_TIP":"Used to describe something made of or resembling nylon.",
      "TAGS":[
        "Common"
      ],
      "DEF_EN":"Made of or containing nylon.",
      "DEF_ZH":"尼龙制的；含有尼龙的。",
      "SENT_EN":"She was learning to play the classical guitar, which typically uses nylon strings.",
      "SENT_ZH":"她正在学习弹古典吉他，这种吉他通常使用尼龙弦。",
      "RELATED":[]
    }
  ],
  "REGISTER":"General / Technical"
}