{
  "WORD":"oats",
  "IPA":"/oʊts/",
  "CONJUGATES":"The word 'oats' is almost always used in the plural form to refer to the grain, whether as a crop or a processed product. The singular form 'oat' refers to a single seed or plant of the cereal.",
  "ETYMOLOGY":"From Old English 'āte' (plural 'ātan'), of Germanic origin. Related to Old Norse 'eitr' ('oats').",
  "SINCE":"Before 900 AD (Old English period)",
  "MEANINGS":[
    {
      "PATTERN":"oats",
      "POS":"n. pl.",
      "POS_TIP":"plural noun: a noun that refers to more than one person, place, thing, or idea, and is typically used with a plural verb.",
      "TAGS":[
        "core word",
        "common",
        "food",
        "agriculture",
        "botany"
      ],
      "DEF_EN":"A type of cereal grass (Avena sativa) grown for its edible grain, which is commonly processed into oatmeal, rolled oats, or used as feed for livestock.",
      "DEF_ZH":"一种谷类作物（燕麦），其可食用的籽粒常被加工成燕麦片、燕麦卷或用作牲畜饲料。",
      "SENT_EN":"She had a bowl of oats for breakfast this morning, served with honey and berries.",
      "SENT_ZH":"她今天早上吃了一碗燕麦片当早餐，加了蜂蜜和浆果。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "oatmeal",
            "porridge",
            "grain",
            "cereal"
          ]
        }
      ]
    },
    {
      "PATTERN":"sow one's wild oats",
      "POS":"idiom",
      "POS_TIP":"an idiom is a phrase or expression whose meaning cannot be understood from the ordinary meaning of its individual words; this particular idiom functions as a verbal phrase.",
      "TAGS":[
        "idiomatic",
        "figurative",
        "common phrase",
        "colloquial"
      ],
      "DEF_EN":"To engage in a period of youthful, reckless, and often promiscuous indulgence, especially before settling down to a more responsible lifestyle.",
      "DEF_ZH":"指年轻时过着放荡不羁、不负责任的生活，尤其指性方面，常在安定下来之前。",
      "SENT_EN":"He spent his early twenties sowing his wild oats, traveling the world and having various adventures.",
      "SENT_ZH":"他二十出头的时候都在挥霍青春，周游世界，经历各种冒险。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "kick up one's heels",
            "live it up",
            "have a fling"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Standard English"
}