{
  "WORD":"obsession",
  "IPA":"/əbˈsɛʃən/",
  "CONJUGATES":"obsessions",
  "ETYMOLOGY":"From Latin 'obsessio' (a siege, blockade, or investment), from 'obsidere' (to besiege, occupy, or sit opposite to), from 'ob-' (against, before) + 'sedere' (to sit). The psychological sense emerged in English by the early 17th century, referring to a persistent idea or feeling.",
  "SINCE":"Early 17th century (for the psychological sense)",
  "MEANINGS":[
    {
      "PATTERN":"obsession with [sth/sb]",
      "POS":"n. (uncountable/countable)",
      "POS_TIP":"Noun (uncountable or countable): A word that names a person, place, thing, or idea; can refer to a general concept or specific instances.",
      "TAGS":[
        "core word",
        "psychology",
        "common"
      ],
      "DEF_EN":"An idea or thought that continually preoccupies or intrudes on a person's mind, often to an excessive or abnormal degree; a compelling or repetitive thought or feeling.",
      "DEF_ZH":"一种持续不断地占据或侵扰个人思想的观念、想法或情感，通常达到过度或不正常的程度；一种强迫性的或重复性的思维或感受。",
      "SENT_EN":"He developed an obsession with collecting rare stamps.",
      "SENT_ZH":"他对收集珍稀邮票产生了痴迷。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "preoccupation",
            "fixation",
            "compulsion",
            "mania",
            "fascination",
            "addiction"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "disinterest",
            "apathy",
            "indifference",
            "detachment"
          ]
        }
      ]
    },
    {
      "PATTERN":"obsession by [sth/sb]",
      "POS":"n. (uncountable)",
      "POS_TIP":"Noun (uncountable): A word that names a concept or quality that typically does not have a plural form.",
      "TAGS":[
        "literary",
        "old-fashioned",
        "rare"
      ],
      "DEF_EN":"The state of being troubled or controlled by an evil spirit or influence, or by a malevolent external force.",
      "DEF_ZH":"被邪恶力量、鬼魂或有害的外部影响困扰或控制的状态。",
      "SENT_EN":"Some ancient texts describe cases of demonic obsession.",
      "SENT_ZH":"一些古代文献描述了被魔鬼附体的案例。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "possession",
            "haunting",
            "infestation",
            "molestation"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General, frequently used in psychological contexts or to describe strong interests. The second meaning is more literary or historical."
}