{
  "WORD":"Olympics",
  "IPA":"/əˈlɪmpɪks/",
  "CONJUGATES":"Olympic (adj.) | Olympian (n.)",
  "ETYMOLOGY":"From Ancient Greek 'Olympia' (place where the games were held) and 'Olympios' (of Olympus, referring to the home of the gods). The modern games were revived based on these ancient traditions.",
  "SINCE":"Modern era: 1896 (first modern games); Ancient era: 776 BCE (first recorded ancient games)",
  "MEANINGS":[
    {
      "PATTERN":"the Olympics",
      "POS":"proper noun",
      "POS_TIP":"A proper noun is a name used for a specific event series, always capitalized. It is plural in form but often treated as a singular concept.",
      "TAGS":[
        "core word",
        "very common",
        "sports",
        "international event"
      ],
      "DEF_EN":"A major international multi-sport event, held every four years, featuring summer and winter sports competitions in which thousands of athletes from around the world participate.",
      "DEF_ZH":"一项主要的国际综合性体育赛事，每四年举办一次，包括夏季和冬季运动会，吸引来自世界各地的数千名运动员参与。",
      "SENT_EN":"The Summer Olympics are a highly anticipated global event.",
      "SENT_ZH":"夏季奥运会是一项备受期待的全球盛事。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Paralympics",
            "Commonwealth Games",
            "Asian Games"
          ]
        }
      ]
    },
    {
      "PATTERN":"Ancient Olympics",
      "POS":"proper noun",
      "POS_TIP":"A proper noun referring to a specific historical event series.",
      "TAGS":[
        "historical",
        "ancient",
        "sports"
      ],
      "DEF_EN":"The ancient Greek athletic and religious festivals held every four years at Olympia, Greece, from 776 BC to 393 AD.",
      "DEF_ZH":"古希腊的体育和宗教节日，从公元前776年到公元393年，每四年在希腊奥林匹亚举行。",
      "SENT_EN":"The first recorded Ancient Olympics took place in 776 BC.",
      "SENT_ZH":"有记载的第一届古代奥运会发生在公元前776年。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Panhellenic Games"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Common usage, frequently appearing in news, sports commentary, and general conversation related to international events."
}