{
  "WORD":"oriental",
  "IPA":"/ˌɔːriˈɛntəl/",
  "CONJUGATES":"orientals (plural, when used as a noun)",
  "ETYMOLOGY":"From Old French 'oriental', from Latin 'orientalis' (of the East), from 'oriens' (the rising sun, the East), from 'oriri' (to rise).",
  "SINCE":"Late 14th century",
  "MEANINGS":[
    {
      "PATTERN":"oriental [adj]",
      "POS":"adj",
      "POS_TIP":"adjective: a word that describes or modifies a noun or pronoun.",
      "TAGS":[
        "core word",
        "common",
        "formal",
        "neutral (for objects/concepts)"
      ],
      "DEF_EN":"Relating to or characteristic of the countries, cultures, or peoples of the East, especially East Asia and Southeast Asia. When referring to objects or concepts (e.g., 'oriental art', 'oriental spices'), it is generally considered neutral. However, when referring to people, it is now widely considered dated and potentially offensive.",
      "DEF_ZH":"东方（尤指东亚和东南亚）的；具有东方特色或风格的。当指代物品或概念时（例如“东方艺术”、“东方香料”），通常是中性的。然而，当指代人时，现在普遍认为其过时且可能具有冒犯性。",
      "SENT_EN":"The museum has a stunning collection of oriental ceramics.",
      "SENT_ZH":"博物馆收藏有精美的东方陶瓷。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "Eastern",
            "Asian (broader)"
          ]
        },
        {
          "T":"related",
          "V":[
            "East Asian",
            "Southeast Asian",
            "Far Eastern"
          ]
        }
      ]
    },
    {
      "PATTERN":"an Oriental [n]",
      "POS":"n",
      "POS_TIP":"noun: a word that names a person, place, thing, or idea.",
      "TAGS":[
        "dated",
        "offensive",
        "informal",
        "rare"
      ],
      "DEF_EN":"(Dated, often offensive) A person from East Asia or Southeast Asia. This term is now widely considered offensive when referring to people, and 'Asian person' or more specific regional terms are preferred.",
      "DEF_ZH":"（过时，常带有冒犯性）东方人，尤指东亚或东南亚人。此词在指代人时现在普遍认为具有冒犯性，应优先使用“亚洲人”或更具体的地域称谓。",
      "SENT_EN":"Referring to someone as 'an Oriental' is generally considered offensive nowadays.",
      "SENT_ZH":"现在，称呼某人为“一个东方人”通常被认为具有冒犯性。",
      "RELATED":[
        {
          "T":"antonyms",
          "V":[
            "Westerner"
          ]
        },
        {
          "T":"related",
          "V":[
            "Asian person",
            "East Asian person"
          ]
        }
      ]
    },
    {
      "PATTERN":"an Oriental [n] (cat)",
      "POS":"n",
      "POS_TIP":"noun: a word that names a person, place, thing, or idea.",
      "TAGS":[
        "specific",
        "common (in pet circles)"
      ],
      "DEF_EN":"A breed of domestic cat, related to the Siamese, characterized by a sleek body, large ears, and a variety of coat colors and patterns.",
      "DEF_ZH":"（猫种）东方短毛猫，一种与暹罗猫相关的家猫品种，以其修长的身体、大耳朵和多样化的毛色及图案为特征。",
      "SENT_EN":"Many cat enthusiasts admire the elegant appearance of an Oriental.",
      "SENT_ZH":"许多爱猫人士都欣赏东方短毛猫优雅的外观。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Siamese",
            "cat breed"
          ]
        }
      ]
    }
  ],
  "REGISTER":"The adjective form describing objects or concepts is generally formal or neutral. The noun form referring to people is widely considered dated and offensive in contemporary English usage."
}