{
  "WORD":"pudding",
  "IPA":"/ˈpʊdɪŋ/",
  "CONJUGATES":"puddings (plural)",
  "ETYMOLOGY":"From Middle English 'podding', 'poding', from Old Northern French 'boudin' (blood sausage), ultimately from Vulgar Latin 'botellinus', a diminutive of 'botellus' ('sausage'), from a Proto-Indo-European root meaning 'to swell'. The meaning evolved from a type of sausage to various dishes, including sweet desserts.",
  "SINCE":"Late 13th century (for savoury dishes), Mid 16th century (for sweet desserts)",
  "MEANINGS":[
    {
      "PATTERN":"[sth] pudding | a pudding",
      "POS":"noun",
      "POS_TIP":"A word that refers to a person, place, thing, idea, or quality. Can be countable or uncountable.",
      "TAGS":[
        "core word",
        "common",
        "food",
        "dessert"
      ],
      "DEF_EN":"A soft, sweet dessert, typically made from milk, sugar, and a thickening agent like flour or cornstarch, often served warm or cold.",
      "DEF_ZH":"一种柔软、香甜的甜点，通常由牛奶、糖和面粉或玉米淀粉等增稠剂制成，常温热或冷食。",
      "SENT_EN":"After dinner, we had a delicious chocolate pudding.",
      "SENT_ZH":"晚饭后，我们吃了一份美味的巧克力布丁。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "dessert",
            "sweet",
            "custard",
            "mousse"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sth] pudding | a pudding",
      "POS":"noun",
      "POS_TIP":"A word that refers to a person, place, thing, idea, or quality. Can be countable or uncountable.",
      "TAGS":[
        "common",
        "food",
        "traditional (UK)",
        "savoury"
      ],
      "DEF_EN":"A traditional savoury dish, often made with meat, suet, or other ingredients, cooked by steaming, boiling, or baking, sometimes inside a casing.",
      "DEF_ZH":"一种传统咸味菜肴，常以肉、板油或其他食材制成，通常通过蒸、煮或烘烤方式烹制，有时在肠衣中制作。",
      "SENT_EN":"Black pudding is a staple ingredient in a traditional full English breakfast.",
      "SENT_ZH":"血肠是传统全套英式早餐中的主食。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "black pudding",
            "Yorkshire pudding",
            "haggis",
            "steak and kidney pudding"
          ]
        }
      ]
    },
    {
      "PATTERN":"the proof of the pudding is in the eating",
      "POS":"idiom",
      "POS_TIP":"A group of words established by usage as having a meaning not deducible from those of the individual words.",
      "TAGS":[
        "idiomatic",
        "common phrase"
      ],
      "DEF_EN":"The true quality or value of something can only be judged when it is tested or used in practice.",
      "DEF_ZH":"事物的真正价值或好坏只有在实践或使用中才能检验出来。",
      "SENT_EN":"He claims his new diet plan works wonders, but the proof of the pudding is in the eating.",
      "SENT_ZH":"他声称他的新食谱效果奇佳，但好坏得试过才知道。",
      "RELATED":[]
    }
  ],
  "REGISTER":"Commonly used in everyday language, especially when discussing food. The idiom is also widely understood."
}