{
  "WORD":"quilt",
  "IPA":"/kwɪlt/",
  "CONJUGATES":"quilts | quilting | quilted",
  "ETYMOLOGY":"From Old French 'quilte' (mattress, cushion), probably from Latin 'culcita' (mattress, cushion).",
  "SINCE":"Late 13th century (noun), Early 17th century (verb)",
  "MEANINGS":[
    {
      "PATTERN":"[sth] quilt",
      "POS":"n",
      "POS_TIP":"noun: a word that refers to a person, place, thing, event, substance, or quality.",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"A bed covering made of two layers of cloth with a layer of batting or stuffing in between, all stitched firmly together, typically in a decorative pattern.",
      "DEF_ZH":"由两层布料夹着一层填充物（如棉絮），并用缝线固定在一起的被子或盖毯，通常有装饰性的图案。",
      "SENT_EN":"My grandmother made me a beautiful patchwork quilt for my birthday.",
      "SENT_ZH":"我奶奶在我生日时给我做了一床漂亮的拼布被子。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "duvet",
            "comforter",
            "bedspread"
          ]
        },
        {
          "T":"related",
          "V":[
            "patchwork",
            "quilting"
          ]
        }
      ]
    },
    {
      "PATTERN":"quilt [sth]",
      "POS":"vtr | vi",
      "POS_TIP":"transitive verb: a verb that takes one or more objects; intransitive verb: a verb that does not take a direct object.",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"To make a quilt by stitching together layers of material, or to stitch layers of material together to form a quilt.",
      "DEF_ZH":"通过缝合多层材料来制作被子或盖毯；或将多层材料缝合在一起形成被子或盖毯。",
      "SENT_EN":"She spent hours quilting the intricate pattern onto the fabric.",
      "SENT_ZH":"她花了几个小时把复杂的图案缝合到布料上。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "stitch",
            "sew"
          ]
        },
        {
          "T":"related",
          "V":[
            "quilter",
            "quilting bee"
          ]
        }
      ]
    },
    {
      "PATTERN":"quilt [sth]",
      "POS":"vtr",
      "POS_TIP":"transitive verb: a verb that takes one or more objects.",
      "TAGS":[
        "less common"
      ],
      "DEF_EN":"To pad or line with material like a quilt, or to make something thick and soft like a quilt for warmth or comfort.",
      "DEF_ZH":"用类似被子的材料填充或衬里，或使某物变得像被子一样厚实柔软，以保暖或舒适。",
      "SENT_EN":"The jacket was quilted for extra warmth.",
      "SENT_ZH":"这件夹克为了增加保暖性而做了夹层。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "pad",
            "stuff",
            "line",
            "cushion"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Commonly used in everyday language, especially in contexts related to textile arts, crafts, and home decor."
}