{
  "WORD":"scorpion",
  "IPA":"/ˈskɔːrpiən/",
  "CONJUGATES":"scorpions (plural)",
  "ETYMOLOGY":"From Old French scorpion, from Latin scorpiō, scorpiōnis, ultimately from Ancient Greek σκορπίος (skorpíos).",
  "SINCE":"c. 1300 (via Anglo-French and Latin), referring to the animal. The constellation usage is older.",
  "MEANINGS":[
    {
      "PATTERN":"scorpion",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "Biology",
        "Arachnid",
        "Common"
      ],
      "DEF_EN":"A terrestrial arachnid of the order Scorpiones, widely distributed in tropical and subtropical regions, characterized by large, grasping pedipalps (pincers) and a long, segmented tail ending in a venomous stinger.",
      "DEF_ZH":"一种陆生蛛形纲动物（蝎目），广泛分布于热带和亚热带地区，特征是具有大的钳状触肢（螯）和一条长而分节的尾巴，尾端带有毒刺。",
      "SENT_EN":"He felt a sharp pain and realized he had been stung by a small scorpion hidden under the log.",
      "SENT_ZH":"他感到一阵剧痛，意识到自己被躲在木头下的一只小蝎子蜇了。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "sting"
          ]
        },
        {
          "T":"related",
          "V":[
            "arachnid",
            "tarantula",
            "venom"
          ]
        }
      ]
    },
    {
      "PATTERN":"scorpion",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "Astrology",
        "Zodiac"
      ],
      "DEF_EN":"A nickname for the astrological sign Scorpio or a person born under this sign, typically covering the period from October 23 to November 21.",
      "DEF_ZH":"指占星学上的天蝎座或出生于该星座的人，通常涵盖10月23日至11月21日期间。",
      "SENT_EN":"As a scorpion, she is known for her intensity and secretive nature.",
      "SENT_ZH":"作为天蝎座的人，她以其强烈的个性和神秘的性格而闻名。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Scorpio",
            "constellation",
            "zodiac"
          ]
        }
      ]
    },
    {
      "PATTERN":"scorpion",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "Historical",
        "Military",
        "Rare"
      ],
      "DEF_EN":"An ancient Roman or Greek military engine, a type of large, powerful crossbow or catapult used for firing arrows or projectiles with great force.",
      "DEF_ZH":"古罗马或古希腊的一种军用机器，一种大型且强力的弩或弹射器，用于以巨大的力量发射箭或投射物。",
      "SENT_EN":"The engineers set up the scorpion weapons to provide covering fire during the siege.",
      "SENT_ZH":"工程师们架设了“蝎子”武器，以便在围攻期间提供掩护火力。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "ballista",
            "catapult",
            "onager"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General"
}