{
  "WORD":"shark",
  "IPA":"/ʃɑːrk/",
  "CONJUGATES":"n. sharks | shark | v. sharks | sharking | sharked",
  "ETYMOLOGY":"First recorded in English in the late 16th century, likely introduced by sailors after encountering the fish in the Caribbean. Its origin is uncertain, possibly from an indigenous Caribbean language, or from a word related to 'shear' or 'sharp'. The sense of a 'rapacious person' or 'swindler' appeared in the early 17th century.",
  "SINCE":"Late 16th century",
  "MEANINGS":[
    {
      "PATTERN":"[a] shark",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "core word",
        "common",
        "biological term"
      ],
      "DEF_EN":"A large, carnivorous marine fish with a cartilaginous skeleton, a fusiform body, and sharp teeth, typically inhabiting tropical and temperate waters, some species of which are considered dangerous to humans.",
      "DEF_ZH":"一种大型肉食性海洋鱼类，骨骼由软骨构成，身体呈纺锤形，有锋利牙齿，通常栖息于热带和温带水域，某些种类对人类有危险。",
      "SENT_EN":"The divers observed a majestic great white shark swimming gracefully near the coral reef.",
      "SENT_ZH":"潜水员们观察到一条雄伟的大白鲨在珊瑚礁附近优雅地游弋。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "predator",
            "fish"
          ]
        },
        {
          "T":"related",
          "V":[
            "ocean",
            "marine life",
            "gill"
          ]
        }
      ]
    },
    {
      "PATTERN":"[a] shark [at sth]",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "informal",
        "figurative",
        "derogatory",
        "common"
      ],
      "DEF_EN":"An unscrupulous or rapacious person who preys on others, especially one who exploits them financially or through deceit; an expert or highly skilled person at something, often used colloquially.",
      "DEF_ZH":"一个不择手段或贪婪的人，尤其指通过经济剥削或欺诈手段利用他人的人；（口语中）指在某方面极其擅长或经验丰富的人。",
      "SENT_EN":"Beware of that loan shark; he'll charge you exorbitant interest rates.",
      "SENT_ZH":"小心那个放高利贷的，他会向你收取高得离谱的利息。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "swindler",
            "scammer",
            "racketeer",
            "expert",
            "pro"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "innocent",
            "dupe"
          ]
        }
      ]
    },
    {
      "PATTERN":"shark [sb/sth]",
      "POS":"v.",
      "POS_TIP":"verb",
      "TAGS":[
        "informal",
        "rare"
      ],
      "DEF_EN":"To obtain by trickery or swindling; to exploit or prey upon (someone) for personal gain.",
      "DEF_ZH":"通过欺骗或诈骗获取；为了个人利益剥削或掠夺（某人）。",
      "SENT_EN":"He tried to shark his friends out of their poker winnings.",
      "SENT_ZH":"他试图骗取朋友的扑克奖金。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "swindle",
            "cheat",
            "scam",
            "exploit"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "help",
            "assist"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General for the fish meaning; informal or colloquial for the figurative person and verb meanings."
}