{
  "WORD":"sidelight",
  "IPA":"/ˈsaɪdˌlaɪt/",
  "CONJUGATES":"sidelights",
  "ETYMOLOGY":"Compound of 'side' (referring to a lateral position) and 'light' (referring to illumination or information). The sense of incidental information developed metaphorically from the physical object.",
  "SINCE":"Circa 1850s (for the metaphorical meaning, earlier for the physical light source).",
  "MEANINGS":[
    {
      "PATTERN":"sidelight [on sth]",
      "POS":"Noun",
      "POS_TIP":"Countable noun",
      "TAGS":[
        "Core",
        "Figurative"
      ],
      "DEF_EN":"A piece of information or detail that is interesting but secondary to the main subject or issue; an incidental piece of knowledge.",
      "DEF_ZH":"次要信息；花絮；侧面情况；附带的细节。",
      "SENT_EN":"The biography offered many interesting sidelights on the singer's otherwise private life.",
      "SENT_ZH":"这本传记提供了许多关于这位歌手的私生活原本不为人知的有趣花絮。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "anecdote",
            "detail",
            "footnote",
            "incidental"
          ]
        },
        {
          "T":"related",
          "V":[
            "background",
            "context"
          ]
        }
      ]
    },
    {
      "PATTERN":"sidelight",
      "POS":"Noun",
      "POS_TIP":"Countable noun",
      "TAGS":[
        "Technical",
        "Automotive",
        "Nautical"
      ],
      "DEF_EN":"A small lamp or set of lights, typically white, green, or red, positioned on the front or sides of a vehicle or vessel, used to indicate its position, especially when parked or driving/sailing in low light conditions (often called 'position light' in US English).",
      "DEF_ZH":"（车辆或船舶的）位置灯；侧灯（用于指示车辆或船舶的位置，尤其在夜间或低光照条件下）。",
      "SENT_EN":"You must switch from sidelights to headlights when driving on unlit roads at night.",
      "SENT_ZH":"在夜间驾驶于没有路灯的道路上时，你必须将位置灯切换成前大灯。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "position light",
            "parking light"
          ]
        },
        {
          "T":"related",
          "V":[
            "headlight",
            "navigation light"
          ]
        }
      ]
    },
    {
      "PATTERN":"sidelight",
      "POS":"Noun",
      "POS_TIP":"Countable noun",
      "TAGS":[
        "Architecture"
      ],
      "DEF_EN":"A narrow fixed or operable window panel placed immediately adjacent to a door or a larger window.",
      "DEF_ZH":"（门或窗旁的）窄侧窗。",
      "SENT_EN":"She chose a traditional door with leaded glass sidelights for the entrance.",
      "SENT_ZH":"她为入口选择了一扇带有铅条玻璃窄侧窗的传统大门。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "transom",
            "window pane"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Standard English"
}