{
  "WORD":"snooker",
  "IPA":"/ˈsnuːkər/",
  "CONJUGATES":"snookers | snookered | snookering",
  "ETYMOLOGY":"Credited to Colonel Sir Neville Chamberlain in India around 1884. The term 'snooker' was military slang for an inexperienced or first-year cadet.",
  "SINCE":"c. 1884",
  "MEANINGS":[
    {
      "PATTERN":"snooker",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "core word",
        "sport",
        "common"
      ],
      "DEF_EN":"A game played on a large billiard table with pockets, involving a cue ball, 15 red balls, and 6 coloured balls, where players aim to score points by potting balls in a specific sequence.",
      "DEF_ZH":"一种在带袋的大型台球桌上进行的比赛，使用一个主球、15个红球和6个彩球，玩家需按特定顺序击球入袋得分。",
      "SENT_EN":"The final of the World Snooker Championship was watched by millions.",
      "SENT_ZH":"数百万观众观看了世界斯诺克锦标赛的决赛。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "billiards",
            "pool",
            "cue sports"
          ]
        }
      ]
    },
    {
      "PATTERN":"(be in) a snooker",
      "POS":"n.",
      "POS_TIP":"noun",
      "TAGS":[
        "technical",
        "sports jargon"
      ],
      "DEF_EN":"A situation in the game of snooker where the cue ball is unable to hit the required object ball directly in a straight line because another ball is obstructing the path.",
      "DEF_ZH":"斯诺克运动中的一种局面，指主球被其他球阻碍，无法直接击中目标球的状态。",
      "SENT_EN":"He left his opponent in a very difficult snooker behind the black ball.",
      "SENT_ZH":"他将对手置于黑球后一个非常困难的斯诺克局面。",
      "RELATED":[]
    },
    {
      "PATTERN":"snooker [sb] | snooker [sth]",
      "POS":"vtr",
      "POS_TIP":"transitive verb",
      "TAGS":[
        "common",
        "colloquial",
        "figurative"
      ],
      "DEF_EN":"To put an opponent into a snooker position; (figuratively, UK slang) to defeat, thwart, or corner someone, often by clever maneuvering.",
      "DEF_ZH":"使（对手）处于斯诺克局面；（口语，引申义）巧妙地挫败、使某人陷入困境或被困住。",
      "SENT_EN":"The accountant managed to snooker the opposition by finding a loophole in the contract.",
      "SENT_ZH":"这位会计师通过找到合同中的漏洞，成功地挫败了反对者。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "corner",
            "thwart",
            "outmaneuver"
          ]
        },
        {
          "T":"related",
          "V":[
            "impede",
            "obstruct"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Sports, General Communication (UK English)"
}