{
  "WORD":"soap",
  "IPA":"/soʊp/",
  "CONJUGATES":"soaps | soaped | soaping",
  "ETYMOLOGY":"From Old English sāpe, from Proto-Germanic *saipǭ, of uncertain ultimate origin but cognate with Latin sapo. Originally referred to a substance used for hair styling.",
  "SINCE":"Old English (pre-11th century)",
  "MEANINGS":[
    {
      "PATTERN":"[sth] soap",
      "POS":"noun",
      "POS_TIP":"A noun is a word that functions as the name of a specific object or set of objects, such as a person, place, thing, or idea. It can be countable (can be counted as individual units) or uncountable (cannot be counted).",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"A substance used with water for washing and cleaning, typically made from a combination of fats or oils with an alkali.",
      "DEF_ZH":"一种与水一起用于洗涤和清洁的物质，通常由脂肪或油与碱结合制成。",
      "SENT_EN":"She bought a bar of lavender soap for her bathroom.",
      "SENT_ZH":"她为浴室买了一块薰衣草香皂。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "detergent",
            "cleanser",
            "shampoo",
            "lather"
          ]
        },
        {
          "T":"related",
          "V":[
            "soap dish",
            "bubble bath"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sb/sth] soap | soap [sth] [down/up]",
      "POS":"verb",
      "POS_TIP":"A verb is a word that describes an action, state, or occurrence. It can be transitive (takes a direct object) or intransitive (does not take a direct object).",
      "TAGS":[
        "common"
      ],
      "DEF_EN":"To wash, clean, or treat with soap.",
      "DEF_ZH":"用肥皂洗涤、清洁或处理。",
      "SENT_EN":"He soaped the sponge and started cleaning the car.",
      "SENT_ZH":"他用肥皂搓洗海绵，开始清洁汽车。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "wash",
            "cleanse",
            "lather"
          ]
        }
      ]
    },
    {
      "PATTERN":"a soap | (in compounds) soap opera",
      "POS":"noun",
      "POS_TIP":"A noun is a word that functions as the name of a specific object or set of objects, such as a person, place, thing, or idea. It is countable, meaning it can be counted as individual units.",
      "TAGS":[
        "informal",
        "common",
        "slang"
      ],
      "DEF_EN":"An informal term for a soap opera, a television or radio drama series dealing typically with domestic themes and broadcast on a daily or weekly basis.",
      "DEF_ZH":"肥皂剧的非正式说法，指通常以家庭主题为内容的电视或广播剧系列，每天或每周播出。",
      "SENT_EN":"My grandmother never misses her favorite afternoon soap.",
      "SENT_ZH":"我奶奶从不L错过她最喜欢的下午肥皂剧。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "melodrama",
            "serial",
            "drama"
          ]
        },
        {
          "T":"related",
          "V":[
            "telenovela",
            "sitcom"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General"
}