{
  "WORD":"swamp",
  "IPA":"/swɑːmp/",
  "CONJUGATES":"swamps | swamping | swamped",
  "ETYMOLOGY":"From Middle English 'swamp' (marshy ground), likely from an Old English word related to 'swamm' (fungus, mushroom, sponge), suggesting spongy, waterlogged ground. The verb meanings developed from the noun in the 17th century.",
  "SINCE":"Middle English (c. 14th century)",
  "MEANINGS":[
    {
      "PATTERN":"[sth]",
      "POS":"noun",
      "POS_TIP":"a word that refers to a person, place, thing, event, substance, or quality.",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"An area of low-lying, uncultivated ground where water collects; a bog or marsh.",
      "DEF_ZH":"地势低洼、未开垦且积水的土地；沼泽地、湿地。",
      "SENT_EN":"The explorers had to trek through a dense swamp to reach the ancient ruins.",
      "SENT_ZH":"探险家们必须跋涉穿过一片茂密的沼泽地才能到达古老的遗迹。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "marsh",
            "bog",
            "wetland",
            "fen",
            "quagmire"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sb] / [sth] is swamped (with [sth])",
      "POS":"verb (transitive)",
      "POS_TIP":"a word or phrase that describes an action, condition, or experience. Transitive verbs take a direct object.",
      "TAGS":[
        "common",
        "idiomatic"
      ],
      "DEF_EN":"To overwhelm or cause to be overwhelmed with an excessive amount of something, especially work or problems.",
      "DEF_ZH":"使（某人）应接不暇；使（某事物）难以应付，尤指工作或问题。",
      "SENT_EN":"I'm completely swamped with emails after my vacation.",
      "SENT_ZH":"度假回来后，我被电子邮件淹没了。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "overwhelm",
            "inundate",
            "deluge",
            "engulf",
            "bury"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "underwhelm",
            "ease"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sth] swamps [sth] / [sth] is swamped",
      "POS":"verb (transitive, intransitive)",
      "POS_TIP":"a word or phrase that describes an action, condition, or experience. Transitive verbs take a direct object, while intransitive verbs do not.",
      "TAGS":[
        "common",
        "nautical"
      ],
      "DEF_EN":"To fill (a boat or other vehicle) with water and cause it to sink or capsize; or for a boat to become filled with water.",
      "DEF_ZH":"（使船只等）进水而沉没或倾覆；（船只）被水灌满。",
      "SENT_EN":"A huge wave swamped the small fishing boat, but luckily no one was injured.",
      "SENT_ZH":"一个巨浪把那艘小渔船淹没了，但幸运的是没有人受伤。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "sink",
            "submerge",
            "capsize",
            "flood",
            "immerse"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General"
}