{
  "WORD":"talent",
  "IPA":"/ˈtælənt/",
  "CONJUGATES":"talents (pl.)",
  "ETYMOLOGY":"From Old French talent (inclination, will, desire), derived from Latin talentum (a unit of weight or currency), which itself came from Ancient Greek tálanton (τάλαντον), originally meaning 'scale, balance'. The shift in meaning to inherent ability occurred due to the widespread interpretation of the Biblical 'Parable of the Talents' (Matthew 25:14–30), where the currency entrusted by the master was interpreted as natural gifts or abilities.",
  "SINCE":"c. 1300 (original meaning of inclination); c. 1550 (meaning of natural ability)",
  "MEANINGS":[
    {
      "PATTERN":"[sth]\n[sb's] talent for [doing sth]",
      "POS":"Noun (U/C)",
      "POS_TIP":"Uncountable or Countable Noun",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"A natural, inherent aptitude, skill, or ability; exceptional natural capacity.",
      "DEF_ZH":"天赋；天资；才能；特长。",
      "SENT_EN":"She has a real talent for understanding complex mathematical concepts.",
      "SENT_ZH":"她在理解复杂的数学概念方面有着真正的天赋。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "gift",
            "flair",
            "genius",
            "aptitude",
            "knack"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "inability",
            "weakness"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sb]\nsearching for new talent",
      "POS":"Noun (C)",
      "POS_TIP":"Countable Noun (often used collectively or in the singular to refer to a person)",
      "TAGS":[
        "collective",
        "industry specific"
      ],
      "DEF_EN":"A person or a group of people possessing significant natural abilities, often specifically recruited in fields like entertainment, sports, or business.",
      "DEF_ZH":"人才（集合概念，指有天赋的人）；有才华者。",
      "SENT_EN":"The film studio is constantly on the lookout for fresh talent to cast in new productions.",
      "SENT_ZH":"这家电影制片厂一直在寻找新的人才来参与新作品的选角。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "prodigy",
            "star",
            "expert"
          ]
        }
      ]
    },
    {
      "PATTERN":"[sth] (a measure)",
      "POS":"Noun (C)",
      "POS_TIP":"Countable Noun",
      "TAGS":[
        "historical",
        "biblical",
        "rare"
      ],
      "DEF_EN":"An ancient unit of weight or currency used in Greece, Rome, and the Middle East, often referenced in historical texts and the Bible.",
      "DEF_ZH":"塔冷通（古代希腊、罗马和中东的重量或货币单位）。",
      "SENT_EN":"The master gave one servant five talents and another only one, according to their ability.",
      "SENT_ZH":"主人按照他们的能力，给了一个仆人五个塔冷通，而另一个只有一个。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "mina",
            "shekel"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Standard"
}