{
  "WORD":"Thanksgiving",
  "IPA":"/ˌθæŋksˈɡɪvɪŋ/",
  "CONJUGATES":"Thanksgivings (plural for specific instances or days of thanksgiving)",
  "ETYMOLOGY":"From Middle English thanks (plural of 'thank', expressing gratitude) + giving (present participle of 'give'). The concept of a designated day for giving thanks has roots in ancient harvest festivals and religious observances; the name 'Thanksgiving' for such a day emerged from English tradition.",
  "SINCE":"16th century (general act of gratitude), 17th century (for a specific day of thanks and celebration), mid-19th century (as a national holiday in the US)",
  "MEANINGS":[
    {
      "PATTERN":"Thanksgiving",
      "POS":"n. proper",
      "POS_TIP":"proper noun: a name used for an individual person, place, or organization, spelled with an initial capital letter.",
      "TAGS":[
        "holiday",
        "culture",
        "US",
        "Canada",
        "core word"
      ],
      "DEF_EN":"A national holiday celebrated in the United States on the fourth Thursday of November and in Canada on the second Monday of October, originally to give thanks for the harvest and other blessings of the past year.",
      "DEF_ZH":"在美国是十一月的第四个星期四，在加拿大是十月的第二个星期一，庆祝的国定假日，最初是为了感谢丰收和过去一年所获得的祝福。",
      "SENT_EN":"Our family always gathers for a big dinner on Thanksgiving.",
      "SENT_ZH":"我们家总是在感恩节那天聚餐。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Harvest Festival",
            "Black Friday",
            "Cyber Monday"
          ]
        }
      ]
    },
    {
      "PATTERN":"thanksgiving",
      "POS":"n. uncountable",
      "POS_TIP":"uncountable noun: a noun that does not have a plural form and refers to something that cannot be counted.",
      "TAGS":[
        "general",
        "abstract",
        "core word",
        "formal"
      ],
      "DEF_EN":"The act of expressing gratitude; an act of giving thanks, especially to God.",
      "DEF_ZH":"表达感激之情的行为；感恩的行为，特别是对上帝的感谢。",
      "SENT_EN":"Let us offer up a prayer of thanksgiving for our safe journey.",
      "SENT_ZH":"让我们为我们的安全旅程献上感恩的祈祷。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "gratitude",
            "thankfulness",
            "appreciation",
            "praise"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "ingratitude",
            "unthankfulness"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Commonly used in general conversation, especially regarding the holiday, and in formal or religious contexts for the act of gratitude."
}