{
  "WORD":"tropic",
  "IPA":"/ˈtrɒpɪk/",
  "CONJUGATES":"tropics",
  "ETYMOLOGY":"From Latin tropicus 'of or belonging to a turn or turning point', from Greek tropikos 'of a turn, of the solstice', from tropos 'turn'. Related to the turning point of the sun at the solstices.",
  "SINCE":"Mid-14th century",
  "MEANINGS":[
    {
      "PATTERN":"the tropic of [sth]",
      "POS":"noun",
      "POS_TIP":"Noun: A word (other than a pronoun) used to identify any of a class of people, places, or things (common noun), or to name a particular one of these (proper noun).",
      "TAGS":[
        "core word",
        "geography",
        "common"
      ],
      "DEF_EN":"Either of the two imaginary circles around the Earth, parallel to the equator at 23.5° north (Tropic of Cancer) or south (Tropic of Capricorn) latitude, marking the boundaries of the tropical zone where the sun is directly overhead at least once a year.",
      "DEF_ZH":"地球上两条假想的纬线之一，位于赤道以北（北回归线）或以南（南回归线）23.5°，标志着热带的边界，太阳每年至少一次直射其上。",
      "SENT_EN":"The Tropic of Capricorn passes through Australia.",
      "SENT_ZH":"南回归线穿过澳大利亚。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "Tropic of Cancer",
            "Tropic of Capricorn",
            "equator",
            "latitude",
            "tropical"
          ]
        }
      ]
    },
    {
      "PATTERN":"the tropics",
      "POS":"plural noun",
      "POS_TIP":"Plural noun: A noun that denotes more than one person, place, thing, or idea.",
      "TAGS":[
        "core word",
        "geography",
        "common"
      ],
      "DEF_EN":"The region of the Earth lying between the Tropic of Cancer and the Tropic of Capricorn, characterized by a hot, often humid climate.",
      "DEF_ZH":"地球上位于北回归线和南回归线之间的区域，气候炎热潮湿。",
      "SENT_EN":"Many exotic fruits grow only in the tropics.",
      "SENT_ZH":"许多异国水果只能在热带地区生长。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "tropical zone",
            "equatorial region"
          ]
        },
        {
          "T":"related",
          "V":[
            "tropical",
            "equator",
            "monsoon"
          ]
        }
      ]
    },
    {
      "PATTERN":"[tropic] climate",
      "POS":"adjective",
      "POS_TIP":"Adjective: A word or phrase naming an attribute, added to or grammatically related to a noun to modify or describe it.",
      "TAGS":[
        "rare",
        "archaic",
        "scientific"
      ],
      "DEF_EN":"Relating to or characteristic of the tropics; tropical. (Often replaced by 'tropical' in modern usage).",
      "DEF_ZH":"与热带地区有关的；热带的。（现代用法中常被'tropical'替代）",
      "SENT_EN":"Botanists study the unique flora of tropic regions.",
      "SENT_ZH":"植物学家研究热带地区独特的植物群。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "tropical"
          ]
        },
        {
          "T":"related",
          "V":[
            "tropicbird"
          ]
        }
      ]
    }
  ],
  "REGISTER":"General, geographical, scientific"
}