{
  "WORD":"turkey",
  "IPA":"/ˈtɜːrki/",
  "CONJUGATES":"plural: turkeys",
  "ETYMOLOGY":"The bird was originally thought to have come from the country Turkey, imported to Europe by Turkish merchants. The name 'turkey' was first applied to guinea fowl, which were imported from Africa to Europe via the Ottoman Empire (often referred to as Turkey). When the larger American bird was introduced, it was mistakenly identified with the guinea fowl and so received the same name.",
  "SINCE":"Early 16th century (for the bird)",
  "MEANINGS":[
    {
      "PATTERN":"a turkey",
      "POS":"noun",
      "POS_TIP":"A word that refers to a person, place, thing, event, substance, or quality.",
      "TAGS":[
        "core word",
        "common",
        "animal"
      ],
      "DEF_EN":"A large, domesticated North American bird, often eaten as food, especially at Thanksgiving and Christmas.",
      "DEF_ZH":"一种大型北美驯养鸟类，常作为食物食用，尤其在感恩节和圣诞节。",
      "SENT_EN":"We always have a roast turkey for our Thanksgiving dinner.",
      "SENT_ZH":"我们感恩节晚餐总是吃烤火鸡。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "poultry",
            "chicken"
          ]
        }
      ]
    },
    {
      "PATTERN":"Turkey",
      "POS":"proper noun",
      "POS_TIP":"A noun that identifies a single entity and is used to refer to that entity, usually capitalized.",
      "TAGS":[
        "core word",
        "common",
        "geography"
      ],
      "DEF_EN":"A transcontinental country located mainly on the Anatolian peninsula in Western Asia, with a smaller portion on the Balkan peninsula in Southeast Europe.",
      "DEF_ZH":"一个横跨欧亚大陆的国家，主要位于西亚的安纳托利亚半岛，一小部分位于东南欧的巴尔干半岛。",
      "SENT_EN":"Istanbul is the largest city in Turkey.",
      "SENT_ZH":"伊斯坦布尔是土耳其最大的城市。",
      "RELATED":[]
    },
    {
      "PATTERN":"a turkey",
      "POS":"noun (slang)",
      "POS_TIP":"A word that refers to a person, place, thing, event, substance, or quality.",
      "TAGS":[
        "slang",
        "informal",
        "rare"
      ],
      "DEF_EN":"An utter failure; a thing or situation that is very unsuccessful.",
      "DEF_ZH":"彻底的失败；非常不成功的事情或情况。",
      "SENT_EN":"The new movie was a real turkey at the box office.",
      "SENT_ZH":"那部新电影在票房上彻底失败了。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "flop",
            "disaster",
            "fiasco"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "hit",
            "success"
          ]
        }
      ]
    }
  ],
  "REGISTER":"The first two meanings are common in general usage. The third meaning (failure) is informal slang and less common."
}