{
  "WORD":"turn up",
  "IPA":"/ˈtɜːrn ʌp/",
  "CONJUGATES":"turns up | turning up | turned up",
  "ETYMOLOGY":"Phrasal verb formed from the Middle English verb 'turn' (from Old French torner, ultimately from Latin tornāre 'to turn in a lathe') and the adverb 'up'. The various senses of appearance and increase evolved naturally from the core meaning of movement towards a higher or more visible state.",
  "SINCE":"18th century",
  "MEANINGS":[
    {
      "PATTERN":"turn up [sth] (volume, heat, music)",
      "POS":"vtr + adv (separable)",
      "POS_TIP":"Transitive verb followed by an adverb, meaning the object can be placed between the verb and the adverb (turn the music up).",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"To increase the volume, intensity, or flow of something (especially sound, heat, or light).",
      "DEF_ZH":"调高；增大（音量、温度或亮度等）。",
      "SENT_EN":"Could you turn up the heating? It’s cold in here.",
      "SENT_ZH":"你能把暖气调高一点吗？这里很冷。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "increase",
            "raise",
            "boost"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "turn down",
            "decrease"
          ]
        }
      ]
    },
    {
      "PATTERN":"turn up [sb] / [sth]",
      "POS":"vint + adv",
      "POS_TIP":"Intransitive verb followed by an adverb, meaning the verb cannot take a direct object.",
      "TAGS":[
        "core word",
        "idiomatic",
        "common"
      ],
      "DEF_EN":"To arrive or appear, especially unexpectedly or after a period of absence.",
      "DEF_ZH":"出现；露面；到场（尤指出乎意料或迟到）。",
      "SENT_EN":"We waited for hours, but the key witness never turned up.",
      "SENT_ZH":"我们等了好几个小时，但那位关键证人从未出现。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "appear",
            "show up",
            "arrive"
          ]
        },
        {
          "T":"antonyms",
          "V":[
            "fail to appear",
            "stay away"
          ]
        }
      ]
    },
    {
      "PATTERN":"turn up [sth]",
      "POS":"vtr + adv (separable)",
      "POS_TIP":"Transitive verb followed by an adverb, meaning the object can be placed between the verb and the adverb (turn the money up).",
      "TAGS":[
        "common"
      ],
      "DEF_EN":"To find something, often by chance, that was previously lost or hidden.",
      "DEF_ZH":"发现；找到（丢失或隐藏的东西）。",
      "SENT_EN":"The investigative journalist turned up some shocking evidence during the research.",
      "SENT_ZH":"那位调查记者在研究过程中发现了一些令人震惊的证据。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "find",
            "discover",
            "uncover"
          ]
        }
      ]
    }
  ],
  "REGISTER":"Conversational and informal"
}