{
  "WORD":"whale",
  "IPA":"/weɪl/",
  "CONJUGATES":"noun: whales | verb: whales | whaling | whaled",
  "ETYMOLOGY":"From Old English hwæl, from Proto-Germanic *hwalaz, ultimately from Proto-Indo-European *kʷal-. Related to Dutch walvis and German Wal.",
  "SINCE":"Before 1100 AD (Old English)",
  "MEANINGS":[
    {
      "PATTERN":"[a] whale",
      "POS":"noun",
      "POS_TIP":"a word that functions as the name of a specific object or set of objects, such as living creatures, places, actions, qualities, states of existence, or ideas.",
      "TAGS":[
        "core word",
        "common"
      ],
      "DEF_EN":"A very large marine mammal with a streamlined body and a blowhole on top of the head for breathing, belonging to the order Cetacea.",
      "DEF_ZH":"一种体型庞大、身体流线型、头顶有喷气孔用于呼吸的海洋哺乳动物，属于鲸目。",
      "SENT_EN":"A blue whale is the largest animal on Earth, capable of reaching lengths of over 30 meters.",
      "SENT_ZH":"蓝鲸是地球上最大的动物，体长可达30多米。",
      "RELATED":[
        {
          "T":"related",
          "V":[
            "dolphin",
            "porpoise",
            "orca",
            "mammal"
          ]
        }
      ]
    },
    {
      "PATTERN":"whale [sb/sth]",
      "POS":"vtr",
      "POS_TIP":"transitive verb, requiring a direct object to complete its meaning.",
      "TAGS":[
        "informal",
        "dated",
        "verb"
      ],
      "DEF_EN":"To hit or beat (someone or something) severely.",
      "DEF_ZH":"猛烈打击或痛打（某人或某物）。",
      "SENT_EN":"He whaled on the punching bag for an hour to release his frustration.",
      "SENT_ZH":"他对着沙袋猛击了一小时，以发泄自己的不满。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "thrash",
            "beat",
            "pummel",
            "flog"
          ]
        }
      ]
    },
    {
      "PATTERN":"whale on [sth]",
      "POS":"v. phrase",
      "POS_TIP":"a verb followed by a preposition or adverb, often having a meaning different from the individual words.",
      "TAGS":[
        "informal",
        "idiomatic",
        "verb"
      ],
      "DEF_EN":"To do something with great enthusiasm, force, or skill, often referring to playing a musical instrument.",
      "DEF_ZH":"以极大的热情、力量或技巧做某事，常指演奏乐器。",
      "SENT_EN":"The guitarist really started to whale on his instrument during the solo, captivating the audience.",
      "SENT_ZH":"吉他手在独奏期间真的开始猛弹他的乐器，吸引了所有观众。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "shred",
            "jam",
            "rock out"
          ]
        }
      ]
    },
    {
      "PATTERN":"a whale of a [N]",
      "POS":"idiom",
      "POS_TIP":"a group of words established by usage as having a meaning not deducible from those of the individual words.",
      "TAGS":[
        "idiomatic",
        "common",
        "colloquial"
      ],
      "DEF_EN":"An impressively large, significant, or excellent example of something.",
      "DEF_ZH":"某事物令人印象深刻的巨大、重要或优秀范例。",
      "SENT_EN":"We had a whale of a time at the party, celebrating until the early hours.",
      "SENT_ZH":"我们在派对上玩得非常开心，一直庆祝到凌晨。",
      "RELATED":[
        {
          "T":"synonyms",
          "V":[
            "excellent",
            "fantastic",
            "amazing",
            "tremendous"
          ]
        }
      ]
    }
  ],
  "REGISTER":"The noun form is standard English. The verb forms and the idiom are informal or colloquial."
}